[
  {
    "author": "Edsger W. Dijkstra",
    "content": "Computer Science is no more about computers than astronomy is about telescopes."
  },
  {
    "author": "Edsger W. Dijkstra",
    "content": "Simplicity is prerequisite for reliability."
  },
  {
    "author": "Edsger W. Dijkstra",
    "content": "The computing scientist’s main challenge is not to get confused by the complexities of his own making."
  },
  {
    "author": "Edsger W. Dijkstra",
    "content": "If debugging is the process of removing software bugs, then programming must be the process of putting them in."
  },
  {
    "author": "Edsger W. Dijkstra",
    "content": "A program is like a poem: you cannot write a poem without writing it. Yet people talk about programming as if it were a production process and measure „programmer productivity“ in terms of „number of lines of code produced“. In so doing they book that number on the wrong side of the ledger: We should always refer to „the number of lines of code spent“."
  },
  {
    "author": "Tony Hoare",
    "content": "There are two ways of constructing a software design: One way is to make it so simple that there are obviously no deficiencies, and the other way is to make it so complicated that there are no obvious deficiencies. The first method is far more difficult."
  },
  {
    "author": "Jeff Hammerbacher",
    "content": "The best minds of my generation are thinking about how to make people click ads."
  },
  {
    "author": "Edsger W. Dijkstra",
    "content": "The tools we use have a profound and devious influence on our thinking habits, and therefore on our thinking abilities."
  },
  {
    "author": "Edsger W. Dijkstra",
    "content": "How do we convince people that in programming simplicity and clarity — in short: what mathematicians call \"elegance\" — are not a dispensable luxury, but a crucial matter that decides between success and failure?"
  },
  {
    "author": "Fred Brooks",
    "content": "Adding manpower to a late software project makes it later."
  },
  {
    "author": "Michael Stal",
    "content": "Sometimes there is a silver bullet for boosting software engineering productivity. But you need to shoot the right person."
  },
  {
    "author": "Fred Brooks",
    "content": "Nine women can't make a baby in one month."
  },
  {
    "author": "Jeff Sickel",
    "content": "Deleted code is debugged code."
  },
  {
    "author": "Ken Thompson",
    "content": "When in doubt, use brute force."
  },
  {
    "author": "Fred Brooks",
    "content": "When a task cannot be partitioned because of sequential constraints, the application of more effort has no effect on the schedule. The bearing of a child takes nine months, no matter how many women are assigned."
  },
  {
    "author": "Fred Brooks",
    "content": "If each part of the task must be separately coordinated with each other part, the effort increases as n(n-1)/2. Three workers require three times as much pairwise intercommunication as two; four require six times as much as two."
  },
  {
    "author": "Fred Brooks",
    "content": "Having a system architect is the most important single step toward conceptual integrity. After teaching a software engineering laboratory more than 20 times, I came to insist that student teams as small as four people choose a manager and a separate architect."
  },
  {
    "author": "Fred Brooks",
    "content": "The programmer, like the poet, works only slightly removed from pure thought-stuff. He builds his castles in the air, from air, creating by exertion of the imagination. Few media of creation are so flexible, so easy to polish and rework, so readily capable of realizing grand conceptual structures."
  },
  {
    "author": "Fred Brooks",
    "content": "The first false assumption that underlies the scheduling of systems programming is that all will go well, i.e., that each task will hike only as long as it \"ought\" to take. A large programming effort, however, consists of many tasks, some chained end-to-end. The probability that each will go well becomes vanishingly small."
  },
  {
    "author": "Donald Knuth",
    "content": "We should forget about small efficiencies, say about 97% of the time: premature optimization is the root of all evil. Yet we should not pass up our opportunities in that critical 3%."
  },
  {
    "author": "Ken Thompson",
    "content": "One of my most productive days was throwing away 1,000 lines of code."
  },
  {
    "author": "Grace Hopper",
    "content": "One accurate measurement is worth more than a thousand expert opinions."
  },
  {
    "author": "Fred Brooks",
    "content": "What one programmer can do in one month, two programmers can do in two months."
  },
  {
    "author": "Rick Osborne",
    "content": "Always code as if the guy who ends up maintaining your code will be a violent psychopath who knows where you live."
  },
  {
    "author": "John Ousterhout",
    "content": "A program that produces incorrect results twice as fast is infinitely slower."
  },
  {
    "author": "Poul Anderson",
    "content": "I have yet to see any problem, however complicated, which when looked at in the right way, did not become more complicated."
  },
  {
    "author": "Robert C. Martin",
    "content": "Cleaning code does NOT take time. NOT cleaning code does take time."
  },
  {
    "author": "David Gelernter",
    "content": "Beauty is more important in computing than anywhere else in technology because software is so complicated. Beauty is the ultimate defense against complexity."
  },
  {
    "author": "Edward V. Berard",
    "content": "Walking on water and developing software from a specification are easy if both are frozen."
  },
  {
    "author": "Brian Kernighan",
    "content": "Debugging is twice as hard as writing the code in the first place. Therefore, if you write the code as cleverly as possible, you are, by definition, not smart enough to debug it."
  },
  {
    "author": "Brian Kernighan",
    "content": "Controlling complexity is the essence of computer programming."
  },
  {
    "author": "Chris Wenham",
    "content": "Debugging time increases as a square of the program’s size."
  },
  {
    "author": "Seymour Cray",
    "content": "The trouble with programmers is that you can never tell what a programmer is doing until it’s too late."
  },
  {
    "author": "Ron Jeffries",
    "content": "Code never lies, comments sometimes do."
  },
  {
    "author": "Laurence J. Peter",
    "content": "Some problems are so complex that you have to be highly intelligent and well informed just to be undecided about them."
  },
  {
    "author": "Poul-Henning Kamp",
    "content": "Make a guess, double the number, and then move to the next larger unit of time. This rule scales tasks in a very interesting way: a one-minute task explodes by a factor of 120 to take two hours. A one-hour job explodes by \"only\" a factor 48 to take two days, while a one-day job grows by a factor of 14 to take two weeks."
  },
  {
    "author": "Albert Einstein",
    "content": "I have no special talent. I am only passionately curious."
  },
  {
    "author": "Robert C. Martin",
    "content": "The proper use of comments is to compensate for our failure to express ourself in code."
  },
  {
    "author": "Rob Pike",
    "content": "When there is no type hierarchy you don’t have to manage the type hierarchy."
  },
  {
    "author": "Steve Jobs",
    "content": "Everybody should learn to program a computer, because it teaches you how to think."
  },
  {
    "author": "Chris Sacca",
    "content": "Simplicity is hard to build, easy to use, and hard to charge for. Complexity is easy to build, hard to use, and easy to charge for."
  },
  {
    "author": "Bill Gates",
    "content": "Measuring programming progress by lines of code is like measuring aircraft building progress by weight."
  },
  {
    "author": "William Wulf",
    "content": "More computing sins are committed in the name of efficiency (without necessarily achieving it) than for any other single reason - including blind stupidity."
  },
  {
    "author": "Edsger W. Dijkstra",
    "content": "Testing can be a very effective way to show the presence of bugs, but it is hopelessly inadequate for showing their absence."
  },
  {
    "author": "Albert Einstein",
    "content": "Imagination is more important than knowledge."
  },
  {
    "author": "Buckminster Fuller",
    "content": "When I am working on a problem I never think about beauty. I think only how to solve the problem. But when I have finished, if the solution is not beautiful, I know it is wrong."
  },
  {
    "author": "Sean Parent",
    "content": "Good code is short, simple, and symmetrical - the challenge is figuring out how to get there."
  },
  {
    "author": "Linus Torvalds",
    "content": "If you think your users are idiots, only idiots will use it."
  },
  {
    "author": "Albert Einstein",
    "content": "Once you stop learning you start dying."
  },
  {
    "author": "Kevlin Henney",
    "content": "No code is faster than no code."
  },
  {
    "author": "Richard P. Gabriel",
    "content": "Over half of the time you spend working on a project is spent thinking, and no tool, no matter how advanced, can think for you."
  },
  {
    "author": "Edsger W. Dijkstra",
    "content": "We could, for instance, begin with cleaning up our language by no longer calling a bug a bug but by calling it an error. It is much more honest because it squarely puts the blame where it belongs, viz. with the programmer who made the error. The animistic metaphor of the bug that maliciously sneaked in while the programmer was not looking is intellectually dishonest as it disguises that the error is the programmer's own creation. The nice thing of this simple change of vocabulary is that it has such a profound effect: while, before, a program with only one bug used to be \"almost correct\", afterwards a program with an error is just \"wrong\"."
  },
  {
    "author": "Stewart Brand",
    "content": "Once a new technology starts rolling, if you’re not part of the steamroller, you’re part of the road."
  },
  {
    "author": "John Gall (author)",
    "content": "A complex system that works is invariably found to have evolved from a simple system that worked. The inverse proposition also appears to be true: A complex system designed from scratch never works and cannot be made to work."
  },
  {
    "author": "Henry Petroski",
    "content": "The most amazing achievement of the computer software industry is its continuing cancellation of the steady and staggering gains made by the computer hardware industry."
  },
  {
    "author": "Carl Friedrich Gauss",
    "content": "I am never satisfied until I have said as much as possible in a few words, and writing briefly takes far more time than writing at length."
  },
  {
    "author": "Bjarne Stroustrup",
    "content": "There are only two kinds of languages: the ones people complain about and the ones nobody uses."
  },
  {
    "author": "Pamela Zave",
    "content": "The purpose of software engineering is to control complexity, not to create it."
  },
  {
    "author": "Dennis Ritchie",
    "content": "Unix is simple. It just takes a genius to understand its simplicity."
  },
  {
    "author": "Dennis Ritchie",
    "content": "A language that doesn’t have everything is actually easier to program in than some that do."
  },
  {
    "author": "Richard Feynman",
    "content": "What I cannot build, I do not understand."
  },
  {
    "author": "Albert Einstein",
    "content": "Any intelligent fool can make things bigger, more complex, and more violent. It takes a touch of genius – and a lot of courage – to move in the opposite direction."
  },
  {
    "author": "Lawrence Flon",
    "content": "There is no programming language, no matter how structured, that will prevent programmers from making bad programs."
  },
  {
    "author": "Martin Fowler",
    "content": "Any fool can write code that a computer can understand. Good programmers write code that humans can understand."
  },
  {
    "author": "Joe Armstrong (programmer)",
    "content": "The problem with object-oriented languages is they’ve got all this implicit environment that they carry around with them. You wanted a banana but what you got was a gorilla holding the banana and the entire jungle."
  },
  {
    "author": "Ken Thompson",
    "content": "You can’t trust code that you did not totally create yourself."
  },
  {
    "author": "Albert Einstein",
    "content": "A clever person solves a problem. A wise person avoids it."
  },
  {
    "author": "Bjarne Stroustrup",
    "content": "The most important single aspect of software development is to be clear about what you are trying to build."
  },
  {
    "author": "Jonathan Shewchuk",
    "content": "The only sin is to make a choice without knowing you are making one."
  },
  {
    "author": "Ryan Singer",
    "content": "So much complexity in software comes from trying to make one thing do two things."
  },
  {
    "author": "P. J. Plauger",
    "content": "Hofstadter's Law: It always takes longer than you expect, even when you take into account Hofstadter's Law."
  },
  {
    "author": "John Johnson",
    "content": "First, solve the problem. Then, write the code."
  },
  {
    "author": "Doug Linder",
    "content": "A good programmer is someone who looks both ways before crossing a one-way street."
  },
  {
    "author": "David Wheeler (computer scientist)",
    "content": "Compatibility means deliberately repeating other people’s mistakes."
  },
  {
    "author": "Jeremy S. Anderson",
    "content": "There are two major products that come out of Berkeley: LSD and UNIX. We don't believe this to be a coincidence."
  },
  {
    "author": "Edsger W. Dijkstra",
    "content": "The competent programmer is fully aware of the strictly limited size of his own skull; therefore he approaches the programming task in full humility, and among other things he avoids clever tricks like the plague"
  },
  {
    "author": "Joshua Bloch",
    "content": "When in doubt, leave it out."
  },
  {
    "author": "Linus Torvalds",
    "content": "I will, in fact, claim that the difference between a bad programmer and a good one is whether he considers his code or his data structures more important. Bad programmers worry about the code. Good programmers worry about data structures and their relationships."
  },
  {
    "author": "Albert Einstein",
    "content": "Never memorize something that you can look up."
  },
  {
    "author": "Richard Hamming",
    "content": "Mathematicians stand on each others' shoulders and computer scientists stand on each others' toes."
  },
  {
    "author": "Edsger W. Dijkstra",
    "content": "LISP has assisted a number of our most gifted fellow humans in thinking previously impossible thoughts."
  },
  {
    "author": "Bjarne Stroustrup",
    "content": "An organisation that treats its programmers as morons will soon have programmers that are willing and able to act like morons only."
  },
  {
    "author": "Anonymous",
    "content": "The button is working, only, it cannot be seen."
  },
  {
    "author": "Douglas Crockford",
    "content": "Don't worry about anything. Just do what you can and be the best you can be."
  },
  {
    "author": "Tom DeMarco",
    "content": "The business of software building isn't really high-tech at all. It's most of all a business of talking to each other and writing things down."
  },
  {
    "author": "Paul Graham (programmer)",
    "content": "In programming the hard part isn’t solving problems, but deciding what problems to solve."
  },
  {
    "author": "Tom DeMarco",
    "content": "The manager's function is not to make people work, but to make it possible for people to work."
  },
  {
    "author": "Tom DeMarco",
    "content": "People under pressure don’t work better; they just work faster."
  },
  {
    "author": "Donald Knuth",
    "content": "My main conclusion after spending ten years of my life working on the TEX project is that software is hard. It’s harder than anything else I’ve ever had to do."
  },
  {
    "author": "Donald Knuth",
    "content": "Science is what we understand well enough to explain to a computer. Art is everything else we do."
  },
  {
    "author": "Donald Knuth",
    "content": "We have seen that computer programming is an art, because it applies accumulated knowledge to the world, because it requires skill and ingenuity, and especially because it produces objects of beauty."
  },
  {
    "author": "Donald Knuth",
    "content": "Email is a wonderful thing for people whose role in life is to be on top of things. But not for me; my role is to be on the bottom of things. What I do takes long hours of studying and uninterruptible concentration."
  },
  {
    "author": "Kevlin Henney",
    "content": "Less code equals less bugs."
  },
  {
    "author": "Charles Babbage",
    "content": "As soon as an Analytical Engine exists, it will necessarily guide the future course of science."
  },
  {
    "author": "Charles Babbage",
    "content": "The errors which arise from the absence of facts are far more numerous and more durable than those which result from unsound reasoning respecting true data."
  },
  {
    "author": "Charles Babbage",
    "content": "We have already mentioned what may, perhaps, appear paradoxical to some of our readers, — that the division of labour can be applied with equal success to mental as to mechanical operations, and that it ensures in both the same economy of time."
  },
  {
    "author": "Charles Babbage",
    "content": "On two occasions I have been asked [by members of Parliament]: \"Pray, Mr. Babbage, if you put into the machine wrong figures, will the right answers come out?\" I am not able rightly to apprehend the kind of confusion of ideas that could provoke such a question."
  },
  {
    "author": "Edsger W. Dijkstra",
    "content": "As long as there were no machines, programming was no problem at all; when we had a few weak computers, programming became a mild problem, and now we have gigantic computers, programming has become an equally gigantic problem."
  },
  {
    "author": "Edsger W. Dijkstra",
    "content": "The use of COBOL cripples the mind; its teaching should, therefore, be regarded as a criminal offense."
  },
  {
    "author": "Edsger W. Dijkstra",
    "content": "If you want more effective programmers, you will discover that they should not waste their time debugging, they should not introduce the bugs to start with."
  },
  {
    "author": "Edsger W. Dijkstra",
    "content": "It is practically impossible to teach good programming to students that have had a prior exposure to BASIC: as potential programmers they are mentally mutilated beyond hope of regeneration."
  },
  {
    "author": "Edsger W. Dijkstra",
    "content": "A picture may be worth a thousand words, a formula is worth a thousand pictures."
  },
  {
    "author": "Edsger W. Dijkstra",
    "content": "I mean, if 10 years from now, when you are doing something quick and dirty, you suddenly visualize that I am looking over your shoulders and say to yourself \"Dijkstra would not have liked this\", well, that would be enough immortality for me."
  },
  {
    "author": "Edsger W. Dijkstra",
    "content": "Don't blame me for the fact that competent programming will be too difficult for \"the average programmer\" — you must not fall into the trap of rejecting a surgical technique because it is beyond the capabilities of the barber in his shop around the corner."
  },
  {
    "author": "John von Neumann",
    "content": "Young man, in mathematics you don't understand things. You just get used to them."
  },
  {
    "author": "Dennis Ritchie",
    "content": "C is quirky, flawed, and an enormous success."
  },
  {
    "author": "Edsger W. Dijkstra",
    "content": "It is not the task of the University to offer what society asks for, but to give what society needs."
  },
  {
    "author": "Donald Knuth",
    "content": "By understanding a machine-oriented language, the programmer will tend to use a much more efficient method; it is much closer to reality."
  },
  {
    "author": "Dennis Ritchie",
    "content": "Another danger is that commercial pressures of one sort or another will divert the attention of the best thinkers from real innovation to exploitation of the current fad, from prospecting to mining a known lode."
  },
  {
    "author": "Bjarne Stroustrup",
    "content": "Within C++, there is a much smaller and cleaner language struggling to get out."
  },
  {
    "author": "Bjarne Stroustrup",
    "content": "Anybody who comes to you and says he has a perfect language is either naïve or a salesman."
  },
  {
    "author": "Alan Turing",
    "content": "A man provided with paper, pencil, and rubber, and subject to strict discipline, is in effect a universal machine."
  },
  {
    "author": "Alan Turing",
    "content": "The idea behind digital computers may be explained by saying that these machines are intended to carry out any operations which could be done by a human computer."
  },
  {
    "author": "Alan Turing",
    "content": "Machines take me by surprise with great frequency."
  },
  {
    "author": "Bjarne Stroustrup",
    "content": "Maybe \"just one little global variable\" isn't too unmanageable, but that style leads to code that is useless except to its original programmer."
  },
  {
    "author": "Linus Torvalds",
    "content": "I'm doing a free operating system (just a hobby, won't be big and professional like GNU)."
  },
  {
    "author": "Linus Torvalds",
    "content": "If you need more than 3 levels of indentation, you're screwed anyway, and should fix your program."
  },
  {
    "author": "Linus Torvalds",
    "content": "An infinite number of monkeys typing into GNU Emacs would never make a good program."
  },
  {
    "author": "Linus Torvalds",
    "content": "If Microsoft ever does applications for Linux it means I've won."
  },
  {
    "author": "Linus Torvalds",
    "content": "See, you not only have to be a good coder to create a system like Linux, you have to be a sneaky bastard too ;-)"
  },
  {
    "author": "Linus Torvalds",
    "content": "Really, I'm not out to destroy Microsoft. That will just be a completely unintentional side effect."
  },
  {
    "author": "Linus Torvalds",
    "content": "Talk is cheap. Show me the code."
  },
  {
    "author": "Tom Cargill",
    "content": "The first 90 percent of the code accounts for the first 90 percent of the development time. The remaining 10 percent of the code accounts for the other 90 percent of the development time."
  },
  {
    "author": "Kent Beck",
    "content": "I'm not a great programmer; I'm just a good programmer with great habits."
  },
  {
    "author": "Bill Gates",
    "content": "There's only one trick in software, and that is using a piece of software that's already been written."
  },
  {
    "author": "Steve Jobs",
    "content": "You can't just ask customers what they want and then try to give that to them. By the time you get it built, they'll want something new."
  },
  {
    "author": "Steve Jobs",
    "content": "What a computer is to me is it's the most remarkable tool that we have ever come up with. It's the equivalent of a bicycle for our minds."
  },
  {
    "author": "Marijn Haverbeke",
    "content": "Programming, it turns out, is hard. The fundamental rules are typically simple and clear. But programs built on top of these rules tend to become complex enough to introduce their own rules and complexity. You’re building your own maze, in a way, and you might just get lost in it."
  },
  {
    "author": "Steve Jobs",
    "content": "I'm convinced that about half of what separates the successful entrepreneurs from the non-successful ones is pure perseverance. It is so hard."
  },
  {
    "author": "Steve Jobs",
    "content": "A lot of companies hire people to tell them what to do. We hire people to tell us what to do."
  },
  {
    "author": "Marijn Haverbeke",
    "content": "Computers themselves can do only stupidly straightforward things. The reason they are so useful is that they do these things at an incredibly high speed."
  },
  {
    "author": "Marijn Haverbeke",
    "content": "A program is a building of thought. It is costless to build, it is weightless, and it grows easily under our typing hands. But without care, a program’s size and complexity will grow out of control, confusing even the person who created it."
  },
  {
    "author": "Marijn Haverbeke",
    "content": "There are many terrible mistakes to make in program design, so go ahead and make them so that you understand them better."
  },
  {
    "author": "Donald Knuth",
    "content": "People think that computer science is the art of geniuses but the actual reality is the opposite, just many people doing things that build on each other, like a wall of mini stones."
  },
  {
    "author": "Jamie Zawinski",
    "content": "Professionalism has no place in art, and hacking is art. Software Engineering might be science; but that's not what I do. I'm a hacker, not an engineer."
  },
  {
    "author": "Quarry worker's creed",
    "content": "We who cut mere stones must always be envisioning cathedrals."
  },
  {
    "author": "Roy Fielding",
    "content": "Communication must be stateless in nature, such that each request from client to server must contain all of the information necessary to understand the request, and cannot take advantage of any stored context on the server."
  },
  {
    "author": "Kent Beck",
    "content": "When you feel the need to write a comment, first try to refactor the code so that any comment becomes superfluous."
  },
  {
    "author": "Kent Beck",
    "content": "When you find you have to add a feature to a program, and the program's code is not structured in a convenient way to add the feature, first refactor the program to make it easy to add the feature, then add the feature."
  },
  {
    "author": "Martin Fowler",
    "content": "There are few things more frustrating or time wasting than debugging. Wouldn't it be a hell of a lot quicker if we just didn't create the bugs in the first place?"
  },
  {
    "author": "Martin Fowler",
    "content": "With testing, I know straight away when I added a bug. That lets me fix the bug immediately, before it can crawl off and hide."
  },
  {
    "author": "Martin Fowler",
    "content": "I think one of the most valuable rules is avoid duplication."
  },
  {
    "author": "Martin Fowler",
    "content": "Often designers do complicated things that improve the capacity on a particular hardware platform when it might actually be cheaper to buy more hardware."
  },
  {
    "author": "John Carmack",
    "content": "The situation is so much better for programmers today - a cheap used PC, a linux CD, and an internet account, and you have all the tools necessary to work your way to any level of programming skill you want to shoot for."
  },
  {
    "author": "John Carmack",
    "content": "If you want to set off and go develop some grand new thing, you don't need millions of dollars of capitalization. You need enough pizza and Diet Coke to stick in your refrigerator, a cheap PC to work on, and the dedication to go through with it."
  },
  {
    "author": "John Carmack",
    "content": "Story in a game is like a story in a porn movie. It's expected to be there, but it's not that important."
  },
  {
    "author": "Paul Graham (programmer)",
    "content": "The best thing software can be is easy, but the way to do this is to get the defaults right, not to limit users' choices."
  },
  {
    "author": "Paul Graham (programmer)",
    "content": "The most important thing is to be able to think what you want, not to say what you want."
  },
  {
    "author": "Paul Graham (programmer)",
    "content": "It's not so important what you work on, so long as you're not wasting your time."
  },
  {
    "author": "Paul Graham (programmer)",
    "content": "The top 5% of programmers probably write 99% of the good software."
  },
  {
    "author": "Paul Graham (programmer)",
    "content": "There are few sources of energy so powerful as a procrastinating grad student."
  },
  {
    "author": "Bill Gates",
    "content": "Your most unhappy customers are your greatest source of learning."
  },
  {
    "author": "Bill Gates",
    "content": "We're no longer in the days where everything is super well crafted. But at the heart of the programs that make it to the top, you'll find that the key internal code was done by a few people who really know what they were doing."
  },
  {
    "author": "Ward Cunningham",
    "content": "What is simplicity? Simplicity is the shortest path to a solution."
  },
  {
    "author": "Ward Cunningham",
    "content": "Putting a new feature into a program is important, but refactoring so new features can be added in the future is equally important."
  },
  {
    "author": "Albert Einstein",
    "content": "A new idea comes suddenly and in a rather intuitive way. But intuition is nothing but the outcome of earlier intellectual experience."
  },
  {
    "author": "Ludwig Wittgenstein",
    "content": "The limits of my language mean the limits of my world."
  },
  {
    "author": "Alan Perlis",
    "content": "If you have a procedure with 10 parameters, you probably missed some."
  },
  {
    "author": "George Boole",
    "content": "That language is an instrument of human reason, and not merely a medium for the expression of thought, is a truth generally admitted."
  },
  {
    "author": "Alan Perlis",
    "content": "A language that doesn't affect the way you think about programming, is not worth knowing."
  },
  {
    "author": "Alan Perlis",
    "content": "Simplicity does not precede complexity, but follows it."
  },
  {
    "author": "Alan Perlis",
    "content": "A year spent in artificial intelligence is enough to make one believe in God."
  },
  {
    "author": "Alan Perlis",
    "content": "The best book on programming for the layman is Alice in Wonderland, but that's because it's the best book on anything for the layman."
  },
  {
    "author": "Alan Perlis",
    "content": "Dealing with failure is easy: Work hard to improve."
  },
  {
    "author": "Alan Perlis",
    "content": "A programming language is low level when its programs require attention to the irrelevant."
  },
  {
    "author": "James Gleick",
    "content": "Computer programs are the most intricate, delicately balanced and finely interwoven of all the products of human industry to date."
  },
  {
    "author": "Edsger W. Dijkstra",
    "content": "The effective exploitation of his powers of abstraction must be regarded as one of the most vital activities of a competent programmer."
  },
  {
    "author": "Alan Perlis",
    "content": "Fools ignore complexity. Pragmatists suffer it. Some can avoid it. Geniuses remove it."
  },
  {
    "author": "Hal Abelson",
    "content": "Programs must be written for people to read, and only incidentally for machines to execute."
  },
  {
    "author": "Mark Gibbs",
    "content": "No matter how slick the demo is in rehearsal, when you do it in front of a live audience, the probability of a flawless presentation is inversely proportional to the number of people watching, raised to the power of the amount of money involved."
  },
  {
    "author": "Nathaniel Borenstein",
    "content": "It should be noted that no ethically-trained software engineer would ever consent to write a DestroyBaghdad procedure. Basic professional ethics would instead require him to write a DestroyCity procedure, to which Baghdad could be given as a parameter."
  },
  {
    "author": "Jef Raskin",
    "content": "When we don’t understand a process, we fall into magical thinking about results."
  },
  {
    "author": "John Carmack",
    "content": "Low-level programming is good for the programmer’s soul."
  },
  {
    "author": "Edsger W. Dijkstra",
    "content": "Simplicity and elegance are unpopular because they require hard work and discipline to achieve and education to be appreciated."
  },
  {
    "author": "Ted Nelson",
    "content": "A user interface should be so simple that a beginner in an emergency can understand it within 10 seconds."
  },
  {
    "author": "Ted Nelson",
    "content": "Learning to program has no more to do with designing interactive software than learning to touch type has to do with writing poetry."
  },
  {
    "author": "Alan Perlis",
    "content": "Every program has (at least) two purposes: the one for which it was written and another for which it wasn't."
  },
  {
    "author": "Alan Perlis",
    "content": "In man-machine symbiosis, it is man who must adjust: The machines can't."
  },
  {
    "author": "Alan Perlis",
    "content": "One man's constant is another man's variable."
  },
  {
    "author": "Bill Gates",
    "content": "Success is a lousy teacher. It seduces smart people into thinking they can't lose."
  },
  {
    "author": "Alan Perlis",
    "content": "It is easier to change the specification to fit the program than vice versa."
  },
  {
    "author": "Alan Perlis",
    "content": "I think it is inevitable that people program poorly. Training will not substantially help matters. We have to learn to live with it."
  },
  {
    "author": "Henry Ford",
    "content": "If we’d asked the customers what they wanted, they would have said “faster horses”."
  },
  {
    "author": "David Parnas",
    "content": "I have found that the reason a lot of people are interested in artificial intelligence is the same reason a lot of people are interested in artificial limbs: they are missing one."
  },
  {
    "author": "Leslie Lamport",
    "content": "A distributed system is one in which the failure of a computer you didn’t even know existed can render your own computer unusable."
  },
  {
    "author": "Ward Cunningham",
    "content": "It’s all talk until the code runs."
  },
  {
    "author": "Jan L. A. van de Snepscheut",
    "content": "In theory, there is no difference between theory and practice. But, in practice, there is."
  },
  {
    "author": "Ellen Ullman",
    "content": "We build our computer systems the way we build our cities: over time, without a plan, on top of ruins."
  },
  {
    "author": "Eric S. Raymond",
    "content": "The next best thing to having good ideas is recognizing good ideas from your users."
  },
  {
    "author": "Joel Spolsky",
    "content": "Good software, like good wine, takes time."
  },
  {
    "author": "Eric S. Raymond",
    "content": "Lisp is worth learning for the profound enlightenment experience you will have when you finally get it; that experience will make you a better programmer for the rest of your days, even if you never actually use Lisp itself a lot."
  },
  {
    "author": "Filipe Fortes",
    "content": "Debugging is like being the detective in a crime movie where you are also the murderer."
  },
  {
    "author": "Dennis Ritchie",
    "content": "What we wanted to preserve was not just a good environment in which to do programming, but a system around which fellowship could form."
  },
  {
    "author": "Marvin Minsky",
    "content": "Once the computers got control, we might never get it back."
  },
  {
    "author": "Jef Raskin",
    "content": "A computer shall not waste your time or require you to do more work than is strictly necessary."
  },
  {
    "author": "George Boole",
    "content": "Of the many forms of false culture, a premature converse with abstractions is perhaps the most likely to prove fatal to the growth of a masculine vigour of intellect."
  },
  {
    "author": "Ken Thompson",
    "content": "C++ certainly has its good points. But by and large I think it's a bad language. It does a lot of things half well and it’s just a garbage heap of ideas that are mutually exclusive. It’s way too big, way too complex. And it’s obviously built by a committee."
  },
  {
    "author": "George Boole",
    "content": "No matter how correct a mathematical theorem may appear to be, one ought never to be satisfied that there was not something imperfect about it until it also gives the impression of being beautiful."
  },
  {
    "author": "Ada Lovelace",
    "content": "The Analytical Engine does not occupy common ground with mere 'calculating machines.' It holds a position wholly its own, and the considerations it suggests are more interesting in their nature."
  },
  {
    "author": "Ada Lovelace",
    "content": "The science of operations, as derived from mathematics more especially, is a science of itself, and has its own abstract truth and value."
  },
  {
    "author": "Ada Lovelace",
    "content": "In the case of the Analytical Engine, we have undoubtedly to lay out a certain capital of analytical labour in one particular line, but this is in order that the engine may bring us in a much larger return in another line."
  },
  {
    "author": "Ada Lovelace",
    "content": "We may say most aptly that the Analytical Engine weaves algebraical patterns just as the Jacquard loom weaves flowers and leaves."
  },
  {
    "author": "George Boole",
    "content": "The design of the following treatise is to investigate the fundamental laws of those operations of the mind by which reasoning is performed; to give expression to them in the symbolical language of a Calculus, and upon this foundation to establish the science of Logic and construct its method."
  },
  {
    "author": "John von Neumann",
    "content": "Any one who considers arithmetical methods of producing random digits is, of course, in a state of sin. For, as has been pointed out several times, there is no such thing as a random number."
  },
  {
    "author": "George Boole",
    "content": "There is not only a close analogy between the operations of the mind in general reasoning and its operations in the particular science of Algebra, but there is to a considerable extent an exact agreement in the laws by which the two classes of operations are conducted."
  },
  {
    "author": "John von Neumann",
    "content": "A large part of mathematics which becomes useful developed with absolutely no desire to be useful, and in a situation where nobody could possibly know in what area it would become useful."
  },
  {
    "author": "Friedrich Bauer",
    "content": "Software engineering is the part of computer science which is too difficult for the computer scientist."
  },
  {
    "author": "Grady Booch",
    "content": "The amateur software engineer is always in search of magic, some sensational method or tool whose application promises to render software development trivial. It is the mark of the professional software engineer to know that no such panacea exist."
  },
  {
    "author": "Grady Booch",
    "content": "Good people with a good process will outperform good people with no process every time."
  },
  {
    "author": "Grady Booch",
    "content": "The entire history of software engineering is that of the rise in levels of abstraction."
  },
  {
    "author": "Hal Abelson",
    "content": "The reason that we think computer science is about computers is pretty much the same reason that the Egyptians thought geometry was about surveying instruments: when some field is just getting started and you don't really understand it very well, it's very easy to confuse the essence of what you're doing with the tools that you use."
  },
  {
    "author": "Alan Kay",
    "content": "Most software today is very much like an Egyptian pyramid with millions of bricks piled on top of each other, with no structural integrity, but just done by brute force and thousands of slaves."
  },
  {
    "author": "Bill Gates",
    "content": "Is studying computer science the best way to prepare to be a programmer? No. the best way to prepare is to write programs, and to study great programs that other people have written."
  },
  {
    "author": "Richard Feynman",
    "content": "Computer science differs from physics in that it is not actually a science. It does not study natural objects. Rather, computer science is like engineering; it is all about getting something to do something."
  },
  {
    "author": "Richard Hamming",
    "content": "The purpose of computing is insight, not numbers."
  },
  {
    "author": "Albert Einstein",
    "content": "All of our exalted technological progress, civilization for that matter, is comparable to an axe in the hand of a pathological criminal."
  },
  {
    "author": "Arthur C. Clarke",
    "content": "When a distinguished but elderly scientist states that something is possible, they are almost certainly right. When they state that something is impossible, they are very probably wrong."
  },
  {
    "author": "Dennis Ritchie",
    "content": "Computer science research is different from these more traditional disciplines. Philosophically it differs from the physical sciences because it seeks not to discover, explain, or exploit the natural world, but instead to study the properties of machines of human creation."
  },
  {
    "author": "Arthur C. Clarke",
    "content": "Any sufficiently advanced technology is indistinguishable from magic."
  },
  {
    "author": "Joseph Yoder (computer scientist)",
    "content": "While much attention has been focused on high-level software architectural patterns, what is, in effect, the de-facto standard software architecture is seldom discussed: the Big Ball of Mud."
  },
  {
    "author": "Joseph Yoder (computer scientist)",
    "content": "All too many of our software systems are, architecturally, little more than shantytowns."
  },
  {
    "author": "Joseph Yoder (computer scientist)",
    "content": "Managing a large project is a qualitatively different problem from managing a small one, just as leading a division of infantry into battle is different from commanding a small special forces team."
  },
  {
    "author": "Joseph Yoder (computer scientist)",
    "content": "When you build a prototype, there is always the risk that someone will say \"that's good enough, ship it\". One way to minimize the risk of a prototype being put into production is to write the prototype in using a language or tool that you couldn't possibly use for a production version."
  },
  {
    "author": "Joseph Yoder (computer scientist)",
    "content": "Sadly, architecture has been undervalued for so long that many engineers regard life with a Big Ball of Mud as normal."
  },
  {
    "author": "Joseph Yoder (computer scientist)",
    "content": "The real problem with throwaway code comes when it isn't thrown away."
  },
  {
    "author": "Joseph Yoder (computer scientist)",
    "content": "Sometimes it’s just easier to throw a system away, and start over."
  },
  {
    "author": "Eric S. Raymond",
    "content": "Computer science education cannot make anybody an expert programmer any more than studying brushes and pigment can make somebody an expert painter."
  },
  {
    "author": "Randall E. Stross",
    "content": "The best programmers are not marginally better than merely good ones. They are an order-of-magnitude better, measured by whatever standard: conceptual creativity, speed, ingenuity of design, or problem-solving ability."
  },
  {
    "author": "Alan Kay",
    "content": "I invented the term 'Object-Oriented', and I can tell you I did not have C++ in mind."
  },
  {
    "author": "Linus Torvalds",
    "content": "Most good programmers do programming not because they expect to get paid or get adulation by the public, but because it is fun to program."
  },
  {
    "author": "Alan Perlis",
    "content": "Educators, generals, dieticians, psychologists, and parents program. Armies, students, and some societies are programmed."
  },
  {
    "author": "L. Peter Deutsch",
    "content": "To iterate is human, to recurse divine."
  },
  {
    "author": "Alan Perlis",
    "content": "For all its power, the computer is a harsh taskmaster. Its programs must be correct, and what we wish to say must be said accurately in every detail."
  },
  {
    "author": "John Locke",
    "content": "The acts of the mind, wherein it exerts its power over simple ideas, are chiefly these three: 1. Combining several simple ideas into one compound one, and thus all complex ideas are made. 2. The second is bringing two ideas, whether simple or complex, together, and setting them by one another so as to take a view of them at once, without uniting them into one, by which it gets all its ideas of relations. 3. The third is separating them from all other ideas that accompany them in their real existence: this is called abstraction, and thus all its general ideas are made."
  },
  {
    "author": "Gerald Weinberg",
    "content": "When program developers are not territorial about their code and encourage others to look for bugs and potential improvements, progress speeds up dramatically."
  },
  {
    "author": "Anonymous",
    "content": "The best thing about a boolean is even if you are wrong, you are only off by a bit."
  },
  {
    "author": "Richard E. Pattis",
    "content": "When debugging, novices insert corrective code; experts remove defective code."
  },
  {
    "author": "Douglas Crockford",
    "content": "It turns out that style matters in programming for the same reason that it matters in writing. It makes for better reading."
  },
  {
    "author": "Douglas Crockford",
    "content": "Computer programs are the most complex things that humans make."
  },
  {
    "author": "Douglas Crockford",
    "content": "Most programming languages contain good parts and bad parts. I discovered that I could be better programmer by using only the good parts and avoiding the bad parts."
  },
  {
    "author": "Douglas Crockford",
    "content": "Good architecture is necessary to give programs enough structure to be able to grow large without collapsing into a puddle of confusion."
  },
  {
    "author": "Douglas Crockford",
    "content": "JavaScript is the world's most misunderstood programming language."
  },
  {
    "author": "Douglas Crockford",
    "content": "In JavaScript, there is a beautiful, elegant, highly expressive language that is buried under a steaming pile of good intentions and blunders."
  },
  {
    "author": "Douglas Crockford",
    "content": "Software is usually expected to be modified over the course of its productive life. The process of converting one correct program into a different correct program is extremely challenging."
  },
  {
    "author": "Eric S. Raymond",
    "content": "Every good work of software starts by scratching a developer’s personal itch."
  },
  {
    "author": "Anonymous",
    "content": "You can have the project: Done On Time. Done On Budget. Done Properly - Pick two."
  },
  {
    "author": "Andy Hunt (author)",
    "content": "No one in the brief history of computing has ever written a piece of perfect software. It's unlikely that you'll be the first."
  },
  {
    "author": "Steve Wozniak",
    "content": "Never trust a computer you can’t throw out a window."
  },
  {
    "author": "Alan Kay",
    "content": "The best way to predict the future is to invent it."
  },
  {
    "author": "Martin Fowler",
    "content": "If you can get today’s work done today, but you do it in such a way that you can’t possibly get tomorrow’s work done tomorrow, then you lose."
  },
  {
    "author": "Alan Turing",
    "content": "Codes are a puzzle. A game, just like any other game."
  },
  {
    "author": "Damian Conway",
    "content": "Documentation is a love letter that you write to your future self."
  },
  {
    "author": "Bdale Garbee",
    "content": "Life is too short to run proprietary software."
  },
  {
    "author": "Martin Fowler",
    "content": "W​henever I have to think to understand what the code is doing, I ask myself if I can refactor the code to make that understanding more immediately apparent."
  },
  {
    "author": "David Leinweber",
    "content": "If you give someone a program, you will frustrate them for a day; if you teach them how to program, you will frustrate them for a lifetime."
  },
  {
    "author": "Mario Fusco",
    "content": "The code you write makes you a programmer. The code you delete makes you a good one. The code you don't have to write makes you a great one."
  },
  {
    "author": "Addy Osmani",
    "content": "First do it, then do it right, then do it better."
  },
  {
    "author": "John Carmack",
    "content": "The cost of adding a feature isn’t just the time it takes to code it. The cost also includes the addition of an obstacle to future expansion. The trick is to pick the features that don’t fight each other."
  },
  {
    "author": "George Carrette",
    "content": "First learn computer science and all the theory. Next develop a programming style. Then forget all that and just hack."
  },
  {
    "author": "Anders Hejlsberg",
    "content": "Just because people tell you it can't be done, that doesn't necessarily mean that it can't be done. It just means that they can't do it."
  },
  {
    "author": "Dennis Ritchie",
    "content": "The only way to learn a new programming language is by writing programs in it."
  },
  {
    "author": "Manny Lehman (computer scientist)",
    "content": "An evolving system increases its complexity unless work is done to reduce it."
  },
  {
    "author": "Robert C. Martin",
    "content": "No matter how slow you are writing clean code, you will always be slower if you make a mess."
  },
  {
    "author": "Rob Pike",
    "content": "Fancy algorithms are slow when n is small, and n is usually small."
  },
  {
    "author": "Manuel Blum",
    "content": "The only difference between a FA [finite automata] and a TM [Turing machine] is that the TM, unlike the FA, has paper and pencil. Think about it. It tells you something about the power of writing."
  },
  {
    "author": "Alan Perlis",
    "content": "Within a computer, natural language is unnatural."
  },
  {
    "author": "Brian Cantwell Smith",
    "content": "Just because you've implemented something doesn't mean you understand it."
  },
  {
    "author": "Douglas Crockford",
    "content": "That hardly ever happens is another way of saying 'it happens'."
  },
  {
    "author": "Donald Knuth",
    "content": "Beware of bugs in the above code; I have only proved it correct, not tried it."
  },
  {
    "author": "Ivan Sutherland",
    "content": "A display connected to a digital computer gives us a chance to gain familiarity with concepts not realizable in the physical world. It is a looking glass into a mathematical wonderland."
  },
  {
    "author": "Ralph Johnson (computer scientist)",
    "content": "Before software can be reusable it first has to be usable."
  },
  {
    "author": "Gordon Bell",
    "content": "The cheapest, fastest, and most reliable components are those that aren’t there."
  },
  {
    "author": "Anonymous",
    "content": "In order to understand recursion, one must first understand recursion."
  },
  {
    "author": "Don Norman",
    "content": "The hardest part of design is keeping features out."
  },
  {
    "author": "Luciano Ramalho",
    "content": "Premature abstraction is as bad as premature optimization."
  },
  {
    "author": "Fred Brooks",
    "content": "Much of the essence of building a program is in fact the debugging of the specification."
  },
  {
    "author": "Elon Musk",
    "content": "Any product that needs a manual to work is broken."
  },
  {
    "author": "Kevlin Henney",
    "content": "The act of describing a program in unambiguous detail and the act of programming are one and the same."
  },
  {
    "author": "Elon Musk",
    "content": "I think you should always bear in mind that entropy is not on your side."
  },
  {
    "author": "Elon Musk",
    "content": "The path to the CEO's office should not be through the CFO's office, and it should not be through the marketing department. It needs to be through engineering and design."
  },
  {
    "author": "Elon Musk",
    "content": "People are mistaken when they think that technology just automatically improves. It does not automatically improve. It only improves if a lot of people work very hard to make it better, and actually it will, I think, by itself degrade, actually."
  },
  {
    "author": "Elon Musk",
    "content": "With artificial intelligence we are summoning the demon."
  },
  {
    "author": "Elon Musk",
    "content": "AI is a fundamental risk to the existence of human civilization."
  },
  {
    "author": "Terry Winograd",
    "content": "The main activity of programming is not the origination of new independent programs, but in the integration, modification, and explanation of existing ones."
  },
  {
    "author": "Tim Berners-Lee",
    "content": "Cool URIs don't change."
  },
  {
    "author": "Tim Berners-Lee",
    "content": "I don't believe in the sort of eureka moment idea. I think it's a myth. I'm very suspicious that actually Archimedes had been thinking about that problem for a long time."
  },
  {
    "author": "Tim Berners-Lee",
    "content": "When I invented the web, I didn't have to ask anyone's permission."
  },
  {
    "author": "Elon Musk",
    "content": "We need to be super careful with AI. Potentially more dangerous than nukes."
  },
  {
    "author": "Tim Berners-Lee",
    "content": "I invented the Web just because I needed it, really, because it was so frustrating that it didn't exit."
  },
  {
    "author": "Tim Berners-Lee",
    "content": "To be a hacker - when I use the term - is somebody who is creative and does wonderful things."
  },
  {
    "author": "Tim Berners-Lee",
    "content": "The Domain Name Server (DNS) is the Achilles heel of the Web."
  },
  {
    "author": "Vannevar Bush",
    "content": "Two centuries ago Leibnitz invented a calculating machine which embodied most of the essential features of recent keyboard devices, but it could not then come into use. The economics of the situation were against it."
  },
  {
    "author": "Vannevar Bush",
    "content": "Whenever logical processes of thought are employed, there is an opportunity for the machine."
  },
  {
    "author": "Vannevar Bush",
    "content": "If scientific reasoning were limited to the logical processes of arithmetic, we should not get very far in our understanding of the physical world. One might as well attempt to grasp the game of poker entirely by the use of the mathematics of probability."
  },
  {
    "author": "Ward Cunningham",
    "content": "Shipping first time code is like going into debt. A little debt speeds development so long as it is paid back promptly with a rewrite. The danger occurs when the debt is not repaid. Every minute spent on not-quite-right code counts as interest on that debt. Entire engineering organizations can be brought to a stand-still under the technical debt load."
  },
  {
    "author": "Martin Fowler",
    "content": "Like a financial debt, the technical debt incurs interest payments, which come in the form of the extra effort that we have to do in future development because of the quick and dirty design choice."
  },
  {
    "author": "Steve McConnell",
    "content": "One of the important implications of technical debt is that it must be serviced. If the debt grows large enough, eventually the company will spend more on servicing its debt than it invests in increasing the value of its other assets."
  },
  {
    "author": "Tim Berners-Lee",
    "content": "What's very important from my point of view is that there is one web. Anyone that tries to chop it into two will find that their piece looks very boring."
  },
  {
    "author": "René Descartes",
    "content": "Thus it is observable that the buildings which a single architect has planned and executed, are generally more elegant and commodious than those which several have attempted to improve."
  },
  {
    "author": "Danny Hillis",
    "content": "Computers are the most complex objects we human beings have ever created, but in a fundamental sense they are remarkably simple."
  },
  {
    "author": "Danny Hillis",
    "content": "The magic of a computer lies in its ability to become almost anything you can imagine, as long as you can explain exactly what that is."
  },
  {
    "author": "Danny Hillis",
    "content": "The computer is not just an advanced calculator or camera or paintbrush; rather, it is a device that accelerates and extends our processes of thought."
  },
  {
    "author": "Danny Hillis",
    "content": "With the right programming, a computer can become a theater, a musical instrument, a reference book, a chess opponent. No other entity in the world except a human being has such an adaptable, universal nature."
  },
  {
    "author": "Danny Hillis",
    "content": "Anyone who has ever written a program knows that telling a computer what you want it to do is not as easy as it sounds. Every detail of the computer’s desired operation must be precisely described. For instance, if you tell an accounting program to bill your clients for the amount that each owes, then the computer will send out a weekly bill for $0.00 to clients who owe nothing."
  },
  {
    "author": "Danny Hillis",
    "content": "A skilled programmer is like a poet who can put into words those ideas that others find inexpressible."
  },
  {
    "author": "Danny Hillis",
    "content": "Every computer language has its Shakespeares, and it is a joy to read their code. A well-written computer program possesses style, finesse, even humor—and a clarity that rivals the best prose."
  },
  {
    "author": "Danny Hillis",
    "content": "It turns out that there is no algorithm for examining a program and determining whether or not it is fatally infected with an endless loop. Moreover, it’s not that no one has yet discovered such an algorithm; rather, no such algorithm is possible."
  },
  {
    "author": "Danny Hillis",
    "content": "The class of problems that are computable by a digital computer apparently includes every problem that is computable by any kind of device."
  },
  {
    "author": "Hal Abelson",
    "content": "The programs we use to conjure processes are like a sorcerer's spells. They are carefully composed from symbolic expressions in arcane and esoteric programming languages that prescribe the tasks we want our processes to perform."
  },
  {
    "author": "Fred Brooks",
    "content": "Human beings are not accustomed to being perfect, and few areas of human activity demand it. Adjusting to the requirement for perfection is, I think, the most difficult part of learning to program."
  },
  {
    "author": "Fred Brooks",
    "content": "Because of optimism, we usually expect the number of bugs to be smaller than it turns out to be. Therefore testing is usually the most mis-scheduled part of programming."
  },
  {
    "author": "Danny Hillis",
    "content": "One of the greatest joys in computer programming is discovering a new, faster, more efficient algorithm for doing something — particularly if a lot of well-respected people have come up with worse solutions."
  },
  {
    "author": "Fred Brooks",
    "content": "False scheduling to match the patron's desired date is much more common in our discipline than elsewhere in engineering."
  },
  {
    "author": "Robert L. Glass",
    "content": "The best programmers are up to 28 times better than the worst programmers, according to “individual differences” research. Given that their pay is never commensurate, they are the biggest bargains in the software field."
  },
  {
    "author": "Fred Brooks",
    "content": "Sackman, Erickson, and Grant were measuring performance of a group of experienced programmers. Within just this group the ratios between the best and worst performances averaged about 10:1 on productivity measurements and an amazing 5:1 on program speed and space measurements!"
  },
  {
    "author": "Fred Brooks",
    "content": "Conceptual integrity is the most important consideration in system design. It is better to have a system omit certain anomalous features and improvements, but to reflect one set of design ideas, than to have one that contains many good but independent and uncoordinated ideas."
  },
  {
    "author": "Fred Brooks",
    "content": "The separation of architectural effort from implementation is a very powerful way of getting conceptual integrity on very large projects."
  },
  {
    "author": "Fred Brooks",
    "content": "The general tendency is to over-design the second system, using all the ideas and frills that were cautiously sidetracked on the first one."
  },
  {
    "author": "Fred Brooks",
    "content": "The management question, therefore, is not whether to build a pilot system and throw it away. You will do that. The only question is whether to plan in advance to build a throwaway, or to promise to deliver the throwaway to customers."
  },
  {
    "author": "Fred Brooks",
    "content": "Program building is an entropy-decreasing process, hence inherently metastable. Program maintenance is an entropy-increasing process, and even its most skillful execution only delays the subsidence of the system into unfixable obsolescence."
  },
  {
    "author": "Fred Brooks",
    "content": "Chemical engineers learned long ago that a process that works in the laboratory cannot be implemented in a factory in only one step."
  },
  {
    "author": "Fred Brooks",
    "content": "First, we must observe that the anomaly is not that software progress is so slow but that computer hardware progress is so fast. No other technology since civilization began has seen six orders of magnitude price-performance gain in 30 years."
  },
  {
    "author": "Fred Brooks",
    "content": "Coding is \"90 percent finished\" for half of the total coding time. Debugging is \"99 percent complete\" most of the time."
  },
  {
    "author": "Fred Brooks",
    "content": "The complexity of software is an essential property, not an accidental one. Hence descriptions of a software entity that abstract away its complexity often abstract away its essence."
  },
  {
    "author": "Fred Brooks",
    "content": "Study after study shows that the very best designers produce structures that are faster, smaller, simpler, cleaner, and produced with less effort. The differences between the great and the average approach an order of magnitude."
  },
  {
    "author": "Fred Brooks",
    "content": "A programming systems product takes about nine times as much effort as the component programs written separately for private use."
  },
  {
    "author": "Fred Brooks",
    "content": "My rule of thumb is 1/3 of the schedule for design, 1/6 for coding, 1/4 for component testing, and 1/4 for system testing."
  },
  {
    "author": "Fred Brooks",
    "content": "First, my wife, my colleagues, and my editors find me to err far more often in optimism than in pessimism. I am, after all, a programmer by background, and optimism is an occupational disease of our craft."
  },
  {
    "author": "Fred Brooks",
    "content": "Because we are uncertain about our scheduling estimates, we often lack the courage to defend them stubbornly against management and customer pressure."
  },
  {
    "author": "Fred Brooks",
    "content": "Adding people to a software project increases the total effort necessary in three ways: the work and disruption of repartitioning itself, training the new people, and added intercommunication."
  },
  {
    "author": "Fred Brooks",
    "content": "Very good professional programmers are ten times as productive as poor ones, at same training and two-year experience level."
  },
  {
    "author": "Fred Brooks",
    "content": "Programming increases goes as a power of program size."
  },
  {
    "author": "Daniel T. Barry",
    "content": "Various studies indicate that the optimal team size is between 2 and 5, with 3 being the mode. With more than 5 team members, team management begins to dominate the work."
  },
  {
    "author": "Daniel T. Barry",
    "content": "A stupid error is an algorithmically avoidable error. Mainly, you are stupid if you let an error that a program can detect go undetected."
  },
  {
    "author": "Fred Brooks",
    "content": "All repairs tend to destroy structure, to increase the entropy and disorder of a system."
  },
  {
    "author": "Thomas J. Watson",
    "content": "I think there is a world market for maybe five\ncomputers."
  },
  {
    "author": "Ken Olsen",
    "content": "There is no reason anyone would want a computer in their home."
  },
  {
    "author": "Michael A. Jackson",
    "content": "The beginning of wisdom for a programmer is to recognize the difference between getting his program to work and getting it right."
  },
  {
    "author": "Michael A. Jackson",
    "content": "Two things are known about requirements:\n1. They will change!\n2. They will be misunderstood!"
  },
  {
    "author": "Daniel T. Barry",
    "content": "Every time you improve process, work becomes harder."
  },
  {
    "author": "Daniel T. Barry",
    "content": "There is never enough time to do it right, but there is always enough time to fix it or to do it over."
  },
  {
    "author": "Rich Skrenta",
    "content": "The more code you have, the more places there are for bugs to hide."
  },
  {
    "author": "Gerald Weinberg",
    "content": "If builders built houses the way programmers built programs, the first woodpecker to come along would destroy civilization."
  },
  {
    "author": "Terry Winograd",
    "content": "The techniques of artificial intelligence are to the mind what bureaucracy is to human social interaction."
  },
  {
    "author": "Daniel T. Barry",
    "content": "Code is expensive to change, but design is cheaper to change, and requirements are even cheaper to change."
  },
  {
    "author": "Daniel T. Barry",
    "content": "The cost to repair an error goes up dramatically as project moves towards completion and beyond."
  },
  {
    "author": "Daniel T. Barry",
    "content": "A team of highly competent programmers who are also highly territorial, egotistical politicians will fail while a team of equally competent programmers, who are also egoless, cooperative, team players will succeed."
  },
  {
    "author": "Daniel T. Barry",
    "content": "For most software, efficiency just does not matter."
  },
  {
    "author": "Harlan Mills",
    "content": "The best way to know that you have found the last bug is never to find the first bug."
  },
  {
    "author": "Harlan Mills",
    "content": "An interactive debugger is an outstanding example of what is not needed - it encourages trial-and-error hacking rather than systematic design, and also hides marginal people barely qualified for precision programming."
  },
  {
    "author": "Daniel T. Barry",
    "content": "Thoroughly testing a program is impossible (requires unbounded number of test cases); so try to choose test cases that will expose all errors. That’s very difficult, especially since we do not know what all the errors are, and if we did, we would not need the test cases!"
  },
  {
    "author": "Harlan Mills",
    "content": "The only way for errors to occur in a program is by being put there by the author. No other mechanisms are known."
  },
  {
    "author": "Daniel T. Barry",
    "content": "Reliable computations are obtainable from buggy programs, which after all, are the only kind of programs there are."
  },
  {
    "author": "David Parnas",
    "content": "I can build a reliable system with thousands of bugs, if you let me choose my bugs carefully."
  },
  {
    "author": "Daniel T. Barry",
    "content": "Ed Adams of IBM found that 80% of the reliability problems are caused by only 2% of the defects."
  },
  {
    "author": "Jim Horning",
    "content": "Hardware is the part you can replace. Software is the part you have to keep, because it’s so expensive and nobody understands it any more."
  },
  {
    "author": "Daniel T. Barry",
    "content": "Any technological or managerial scheme to force documentation can be subverted by unwilling programmers."
  },
  {
    "author": "Jim Horning",
    "content": "Good judgement comes from experience. Experience comes from bad judgement."
  },
  {
    "author": "John McCarthy (computer scientist)",
    "content": "Machines as simple as thermostats can be said to have beliefs."
  },
  {
    "author": "Tony Parisi (software developer)",
    "content": "A framework can provide 90% of the features we need quickly — giving us a false sense of confidence early in the development cycle — and then be frustratingly hard when it comes to implementing the last 10%."
  },
  {
    "author": "John McCarthy (computer scientist)",
    "content": "Mental qualities peculiar to human-like motivational structures, such as love and hate, will not be required for intelligent behavior, but we could probably program computers to exhibit them if we wanted to."
  },
  {
    "author": "Richard Stallman",
    "content": "I have met bright students in computer science who have never seen the source code of a large program. They may be good at writing small programs, but they can't begin to learn the different skills of writing large ones if they can't see how others have done it."
  },
  {
    "author": "John McCarthy (computer scientist)",
    "content": "Program designers have a tendency to think of the users as idiots who need to be controlled. They should rather think of their program as a servant, whose master, the user, should be able to control it."
  },
  {
    "author": "Richard Stallman",
    "content": "In fact, in the 1980s I often came across newly graduated computer science majors who had never seen a real program in their lives. They had only seen toy exercises, school exercises, because every real program was a trade secret."
  },
  {
    "author": "Richard Stallman",
    "content": "I figure that since proprietary software developers use copyright to stop us from sharing, we cooperators can use copyright to give other cooperators an advantage of their own: they can use our code."
  },
  {
    "author": "Richard Stallman",
    "content": "I consider that the golden rule requires that if I like a program I must share it with other people who like it. Software sellers want to divide the users and conquer them, making each user agree not to share with others. I refuse to break solidarity with other users in this way."
  },
  {
    "author": "Richard Stallman",
    "content": "The free software community rejects the “priesthood of technology”, which keeps the general public in ignorance of how technology works; we encourage students of any age and situation to read the source code and learn as much as they want to know."
  },
  {
    "author": "Richard Stallman",
    "content": "The most powerful programming language is Lisp. If you don't know Lisp (or its variant, Scheme), you don't know what it means for a programming language to be powerful and elegant. Once you learn Lisp, you will understand what is lacking in most other languages."
  },
  {
    "author": "Richard Stallman",
    "content": "Programming is programming. If you get good at programming, it doesn't matter which language you learned it in, because you'll be able to do programming in any language."
  },
  {
    "author": "Maurice Wilkes",
    "content": "It was on one of my journeys between the EDSAC room and the punching equipment the realization came over me with full force that a good part of the remainder of my life was going to be spent in finding errors in my own programs."
  },
  {
    "author": "Maurice Wilkes",
    "content": "Since 1954, the raw speed of computers, as measured by the time it takes to do an addition, increased by a factor of 10,000. That means an algorithm that once took 10 minutes to perform can now be done 15 times a second."
  },
  {
    "author": "Richard Hamming",
    "content": "Typing is no substitute for thinking."
  },
  {
    "author": "Donald Knuth",
    "content": "A programmer who subconsciously views himself as an artist will enjoy what he does and will do it better."
  },
  {
    "author": "Richard Hamming",
    "content": "Perhaps the central problem we face in all of computer science is how we are to get to the situation where we build on top of the work of others rather than redoing so much of it in a trivially different way."
  },
  {
    "author": "Richard Hamming",
    "content": "Any unwillingness to learn mathematics today can greatly restrict your possibilities tomorrow."
  },
  {
    "author": "Charles Simonyi",
    "content": "Really good programs live forever."
  },
  {
    "author": "Richard Hamming",
    "content": "In science if you know what you are doing you should not be doing it. In engineering if you do not know what you are doing you should not be doing it."
  },
  {
    "author": "Butler Lampson",
    "content": "In handling resources, strive to avoid disaster rather than to attain an optimum."
  },
  {
    "author": "John Warnock",
    "content": "As with most projects, the last two percent takes fifty percent of the time."
  },
  {
    "author": "Gary Kildall",
    "content": "It's fun to sit at a terminal and let the code flow. It sounds strange, but it just comes out my brain; once I'm started, I don't have to think about it."
  },
  {
    "author": "Gary Kildall",
    "content": "I think programming is very much a religious experience for a lot of people."
  },
  {
    "author": "Charles Simonyi",
    "content": "What is programming? Some people call it a science, some people call it an art, some people call it a skill. I think it has aspects of all three."
  },
  {
    "author": "Bill Gates",
    "content": "If you ever talk to a great programmer, you'll find he knows his tools like an artist knows his paintbrushes."
  },
  {
    "author": "Bill Gates",
    "content": "Our goals are very simple. We're going to create the software that puts a computer on every desk and in every home."
  },
  {
    "author": "Dan Bricklin",
    "content": "The most important part of writing a program is designing the data structures."
  },
  {
    "author": "Bob Frankston",
    "content": "Ideas don't disappear. They change form, they merge with other ideas."
  },
  {
    "author": "Peter Roizen",
    "content": "I care not only what the code says but how it looks."
  },
  {
    "author": "Ray Ozzie",
    "content": "Programming is the ultimate field for someone who likes to tinker."
  },
  {
    "author": "Bob content",
    "content": "From an artistic standpoint, the best software comes from the realm of intuition."
  },
  {
    "author": "Andy Hertzfeld",
    "content": "Then Apple went public toward the end of 1980. All of a sudden, all these people I was working with were millionaires."
  },
  {
    "author": "Toru Iwatani",
    "content": "I'm interested in creating images that communicate with people."
  },
  {
    "author": "Charles Simonyi",
    "content": "I think the best way to supervise is by personal example and by frequent code reviews."
  },
  {
    "author": "Butler Lampson",
    "content": "There are some basic techniques to control complexity. Fundamentally, I divide and conquer, break things down, and try to write reasonably precise descriptions of what each piece is supposed to do."
  },
  {
    "author": "Charles Simonyi",
    "content": "The efficiency of the code decreases with an increase in the number of people working on the program. The most efficient programs are written by a single person."
  },
  {
    "author": "Charles Simonyi",
    "content": "I'll bet you that from ten feet away I can tell if a program is bad. I might not guarantee that it is good, but if it looks bad from ten feet, I can guarantee you that it wasn't written with care."
  },
  {
    "author": "Butler Lampson",
    "content": "Nobody knows how to build really complicated hardware systems, so designing hardware tends to be simpler. Software is much more complicated."
  },
  {
    "author": "Butler Lampson",
    "content": "A beautiful program is like a beautiful theorem: It does the job elegantly."
  },
  {
    "author": "John Warnock",
    "content": "To be successful, you want to surround yourself with very talented folks whose skills blend very well. That’s the secret of success."
  },
  {
    "author": "Gary Kildall",
    "content": "I start with drawing the data structures, and I spend a lot of time thinking about them. I also think about what the program has to go through before I start writing code."
  },
  {
    "author": "John Warnock",
    "content": "Don’t go into a two-year development with nothing coming out in the middle. Have something come out every two months, so you can evaluate, regroup, and restart."
  },
  {
    "author": "Gary Kildall",
    "content": "If you learn how to solve problems, you can go through life and do pretty well."
  },
  {
    "author": "Bill Gates",
    "content": "A great programmer thinks about the program on a constant basis, whether driving or eating. That method takes an incredible amount of mental energy."
  },
  {
    "author": "Bill Gates",
    "content": "The really great programs I've written have all been ones that I have thought about for a huge amount of time before I ever wrote them."
  },
  {
    "author": "Bill Gates",
    "content": "There is an amazing commonality in the types of difficulties you run into. In design reviews, I really enjoy being able to provide advice, based on programs that I have done."
  },
  {
    "author": "Fred Brooks",
    "content": "The fundamental problem with program maintenance is that fixing a defect has a substantial (20-50 percent) chance of introducing another. So the whole process is two steps forward and one step back."
  },
  {
    "author": "Addy Osmani",
    "content": "Really care about the tools you use because they are what make you your best."
  },
  {
    "author": "Michael Hawley",
    "content": "What I like about programming is that it really helps you think about how we communicate, how we think, how logic works, how creative arts work."
  },
  {
    "author": "Douglas Crockford",
    "content": "One of the things I’ve been pushing is code reading. I think that is the most useful thing that a community of programmers can do for each other—spend time on a regular basis reading each other’s code."
  },
  {
    "author": "Douglas Crockford",
    "content": "I think the best way to make JavaScript better would be to\nmake it smaller. If we could just get it down to what it does really well and remove the features that add little or no value, it’s actually a better language."
  },
  {
    "author": "Douglas Crockford",
    "content": "Readability of code is now my first priority. It’s more important than being fast, almost as important as being correct, but I think being readable is actually the most likely way of making it correct."
  },
  {
    "author": "Douglas Crockford",
    "content": "Part of what makes programming difficult is most of the time we’re doing stuff we’ve never done before."
  },
  {
    "author": "Douglas Crockford",
    "content": "I think of myself as a writer. Sometimes I write in English and sometimes I write in JavaScript."
  },
  {
    "author": "Jaron Lanier",
    "content": "People should be able to speak and breathe programs just like they talk now."
  },
  {
    "author": "Joe Armstrong (programmer)",
    "content": "If you start removing things, if you get to the point where if you were to remove anything more it would not work any more — at this point it is beautiful."
  },
  {
    "author": "Buckminster Fuller",
    "content": "Humanity is acquiring all the right technology for all the wrong reasons."
  },
  {
    "author": "Simon Peyton Jones",
    "content": "I characterize functional programming as a radical and elegant attack on the whole enterprise of writing programs."
  },
  {
    "author": "Marijn Haverbeke",
    "content": "Size almost always involves complexity, and complexity confuses programmers. Confused programmers, in turn, introduce mistakes (bugs) into programs."
  },
  {
    "author": "Marijn Haverbeke",
    "content": "Flaws in computer programs are usually called bugs. It makes programmers feel good to imagine them as little things that just happen to crawl into our work. In reality, of course, we put them there ourselves."
  },
  {
    "author": "L. Peter Deutsch",
    "content": "When I was at what I would consider the peak of my abilities, I had extremely trustworthy intuition. I would do things and they would just turn out right."
  },
  {
    "author": "L. Peter Deutsch",
    "content": "Every now and then I feel a temptation to design a programming language but then I just lie down until it goes away."
  },
  {
    "author": "L. Peter Deutsch",
    "content": "Language systems stand on a tripod. There’s the language, there’s the libraries, and there are the tools. And how successful a language is depends on a complex interaction between those three things."
  },
  {
    "author": "L. Peter Deutsch",
    "content": "I would make a strong case that programming languages have not improved qualitatively in the last 40 years. There is no programming language in use today that is qualitatively better than Simula-67."
  },
  {
    "author": "Gottfried Wilhelm Leibniz",
    "content": "Instead of the progression of tens, I have for many years used the simplest progression of all, which proceeds by twos, having found that it is useful for the perfection of the science of numbers."
  },
  {
    "author": "L. Peter Deutsch",
    "content": "I never in my wildest dreams would have predicted the evolution of the Internet. And I never would’ve predicted the degree to which corporate influence over the Internet has changed its character over time."
  },
  {
    "author": "Ken Thompson",
    "content": "I’ve never been a lover of existing code. Code by itself almost rots and it’s gotta be rewritten. Even when nothing has changed, for some reason it rots."
  },
  {
    "author": "Ken Thompson",
    "content": "Modern programming scares me in many respects. It confuses me to read a program which you must read top-down. It says “do something.” And you go find “something.” And you read it and it says, “do something else” and you go find something and it says, “do something else” and it goes back to the top maybe. And nothing gets done. It’s just relegating the problem to a deeper and deeper level."
  },
  {
    "author": "Richard Hamming",
    "content": "I always spend a day a week learning new stuff. That means I spend 20% more of my time than my colleagues learning new stuff. Now 20% at compound interest means that after four and a half years I will know twice as much as them."
  },
  {
    "author": "Donald Knuth",
    "content": "I’ll use dirty tricks for two reasons. One is, if it’s really going to give me a performance improvement. Or sometimes just for pure pleasure. In any case, I document it; I don’t just put it in there."
  },
  {
    "author": "Ken Thompson",
    "content": "I’ll throw away code as soon I want to add something to it and I get the feeling that what I have to do to add it is too hard."
  },
  {
    "author": "Donald Knuth",
    "content": "The problem is that coding isn’t fun if all you can do is call things out of a library, if you can’t write the library yourself."
  },
  {
    "author": "Donald Knuth",
    "content": "I make mistakes because I’m always operating at my limit. If I only stay in comfortable territory all the time, that’s not so much fun."
  },
  {
    "author": "Donald Knuth",
    "content": "I’ve got this need to program. I wake up in the morning with sentences of a literate program. Before breakfast — I’m sure poets must feel this — I have to go to the computer and write this paragraph and then I can eat and I’m happy."
  },
  {
    "author": "Donald Knuth",
    "content": "The more varieties of different kinds of notations are still useful — don’t only read the people who code like you."
  },
  {
    "author": "Ted Nelson",
    "content": "The good news about computers is that they do what you tell them to do. The bad news is that they do what you tell them to do."
  },
  {
    "author": "Douglas Crockford",
    "content": "Mathematics is important in programming, but it’s just one of a lot of things that are important. If you overemphasize the math then you underemphasize stuff which might be even more important, such as literacy."
  },
  {
    "author": "Ken Thompson",
    "content": "Documenting is very, very hard; it’s time-consuming. To do it right, you’ve got to do it like programming. You’ve got to deconstruct it, put it together in nice ways, rewrite it when it’s wrong. People don’t do that."
  },
  {
    "author": "Richard Moore (engineercontent",
    "content": "The difference between theory and practice is that in theory, there is no difference between theory and practice."
  },
  {
    "author": "Jim Coplien",
    "content": "You should name a variable using the same care with which you name a first-born child."
  },
  {
    "author": "Robert C. Martin",
    "content": "The ratio of time spent reading versus writing is well over 10 to 1. We are constantly reading old code as part of the effort to write new code."
  },
  {
    "author": "Kyle Simpson",
    "content": "There's nothing more permanent than a temporary hack."
  },
  {
    "author": "Gottfried Wilhelm Leibniz",
    "content": "As numbers are reduced to the simplest principles, like 0 and 1, a wonderful order is apparent throughout."
  },
  {
    "author": "Ted Nelson",
    "content": "In my second year in graduate school, I took a computer course and that was like lightening striking."
  },
  {
    "author": "Ted Nelson",
    "content": "They were saying computers deal with numbers. This was absolutely nonsense. Computers deal with arbitrary information of any kind."
  },
  {
    "author": "Ted Nelson",
    "content": "Right now you are a prisoner of each application you use. You have only the options that were given you by the developer of that application."
  },
  {
    "author": "Ray Ozzie",
    "content": "Complexity kills. It sucks the life out of developers, it makes products difficult to plan, build and test, it introduces security challenges and it causes end-user and administrator frustration."
  },
  {
    "author": "Niklaus Wirth",
    "content": "Software gets slower faster than hardware gets faster."
  },
  {
    "author": "David Parnas",
    "content": "A computer is a stupid machine with the ability to do incredibly smart things, while computer programmers are smart people with the ability to do incredibly stupid things. They are, in short, a perfect match."
  },
  {
    "author": "Anonymous",
    "content": "A few months writing code can save you a few hours in design."
  },
  {
    "author": "Edsger W. Dijkstra",
    "content": "Are you quite sure that all those bells and whistles, all those wonderful facilities of your so called powerful programming languages, belong to the solution set rather than the problem set?"
  },
  {
    "author": "John von Neumann",
    "content": "If people do not believe that mathematics is simple, it is only because they do not realize how complicated life is."
  },
  {
    "author": "Bjarne Stroustrup",
    "content": "C makes it easy to shoot yourself in the foot; C++ makes it harder, but when you do it blows your whole leg off."
  },
  {
    "author": "Bjarne Stroustrup",
    "content": "If you think it's simple, then you have misunderstood the problem."
  },
  {
    "author": "Rob Pike",
    "content": "Object-oriented design is the roman numerals of computing."
  },
  {
    "author": "Steve Jobs",
    "content": "It is hard to think that a $2 billion company with 4,300-plus people couldn't compete with six people in blue jeans."
  },
  {
    "author": "Jamie Zawinski",
    "content": "Some people, when confronted with a problem, think ‘I know, I’ll use regular expressions.’ Now they have two problems."
  },
  {
    "author": "Bill Gates",
    "content": "Sometimes we do get taken by surprise. For example, when the Internet came along, we had it as a fifth or sixth priority."
  },
  {
    "author": "Ward Cunningham",
    "content": "It was a turning point in my programming career when I realized that I didn't have to win every argument."
  },
  {
    "author": "Vint Cerf",
    "content": "And programming computers was so fascinating. You create your own little universe, and then it does what you tell it to do."
  },
  {
    "author": "Joshua Bloch",
    "content": "The cleaner and nicer the program, the faster it's going to run. And if it doesn't, it'll be easy to make it fast."
  },
  {
    "author": "Philip Greenspun",
    "content": "SQL, Lisp, and Haskell are the only programming languages that I've seen where one spends more time thinking than typing."
  },
  {
    "author": "Alan Perlis",
    "content": "It is better to have 100 functions operate on one data structure than to have 10 functions operate on 10 data structures."
  },
  {
    "author": "Brian Kernighan",
    "content": "The most effective debugging tool is still careful thought, coupled with judiciously placed print statements."
  },
  {
    "author": "Marvin Minsky",
    "content": "Computer languages of the future will be more concerned with goals and less with procedures specified by the programmer."
  },
  {
    "author": "Alan Turing",
    "content": "A computer would deserve to be called intelligent if it could deceive a human into believing that it was human."
  },
  {
    "author": "Joseph Yoder (computer scientist)",
    "content": "The way to arrest entropy in software is to refactor it."
  },
  {
    "author": "Joseph Yoder (computer scientist)",
    "content": "Reviews and pair programming provide programmers with something their work would not otherwise have: an audience. Sunlight, it is said is a powerful disinfectant. An immediate audience of one's peers provides immediate incentives to programmers to keep their code clear and comprehensible, as well as functional."
  },
  {
    "author": "John Romero",
    "content": "You might not think that programmers are artists, but programming is an extremely creative profession. It's logic-based creativity."
  },
  {
    "author": "Douglas Crockford",
    "content": "JavaScript is the only language that I'm aware of that people feel they don't need to learn before they start using it."
  },
  {
    "author": "Addy Osmani",
    "content": "Be humble, communicate clearly, and respect others. It costs nothing to be kind, but the impact is priceless."
  },
  {
    "author": "Pete Cordell",
    "content": "Telling a programmer there's already a library to do X is like telling a songwriter there's already a song about love."
  },
  {
    "author": "Stan Kelly-Bootle",
    "content": "Should array indices start at 0 or 1? My compromise of 0.5 was rejected without, I thought, proper consideration."
  },
  {
    "author": "Edsger W. Dijkstra",
    "content": "The purpose of abstraction is not to be vague, but to create a new semantic level in which one can be absolutely precise."
  },
  {
    "author": "Elon Musk",
    "content": "There certainly will be job disruption. Because what's going to happen is robots will be able to do everything better than us."
  },
  {
    "author": "John Carmack",
    "content": "Sometimes, the elegant implementation is a function. Not a method. Not a class. Not a framework. Just a function."
  },
  {
    "author": "Marvin Minsky",
    "content": "Artificial intelligence is the science of making machines do things that would require intelligence if done by men."
  },
  {
    "author": "Tim Berners-Lee",
    "content": "I just had to take the hypertext idea and connect it to the TCP and DNS ideas and — ta-da!— the World Wide Web."
  },
  {
    "author": "Hal Abelson",
    "content": "A computational process is indeed much like a sorcerer's idea of a spirit. It cannot be seen or touched. It is not composed of matter at all. However, it is very real. It can perform intellectual work. It can answer questions. It can affect the world by disbursing money at a bank or by controlling a robot arm in a factory."
  },
  {
    "author": "Fred Brooks",
    "content": "One must assume that there will be lots of bugs, and plan an orderly procedure for snaking them out."
  },
  {
    "author": "Fred Brooks",
    "content": "To achieve conceptual integrity, a design must proceed from one mind or a small group of agreeing minds."
  },
  {
    "author": "Tom DeMarco",
    "content": "The very best technology never has as much impact as girlfriend or boyfriend trouble."
  },
  {
    "author": "Fred Brooks",
    "content": "Maintenance cost is strongly affected by the number of users. More users find more bugs."
  },
  {
    "author": "Daniel T. Barry",
    "content": "Most errors are introduced during requirements specification!"
  },
  {
    "author": "Harlan Mills",
    "content": "Programming is similar to a game of golf. The point is not getting the ball in the hole but how many strokes it takes."
  },
  {
    "author": "Daniel T. Barry",
    "content": "A number of studies have shown testing not very effective at finding bugs."
  },
  {
    "author": "Daniel T. Barry",
    "content": "The key to keeping software costs down is to write code that is easily modified."
  },
  {
    "author": "Daniel T. Barry",
    "content": "The notions of correctness in mathematics and programs are different. A mathematical model must be consistent; it need not match reality (be correct), and it need not be complete (in the formal sense). A program model must be consistent; it must match reality; and it must be complete (in the sense that it reacts gracefully to all inputs)."
  },
  {
    "author": "Daniel T. Barry",
    "content": "Programming is at least as difficult as developing a mathematical theory."
  },
  {
    "author": "Richard Stallman",
    "content": "In 1971 when I joined the staff of the MIT Artificial Intelligence lab, all of us who helped develop the operating system software, we called ourselves hackers. We were not breaking any laws, at least not in doing the hacking we were paid to do. We were developing software and we were having fun. Hacking refers to the spirit of fun in which we were developing software."
  },
  {
    "author": "Maurice Wilkes",
    "content": "By June 1949 people had begun to realize that it was not so easy to get programs right as at one time appeared."
  },
  {
    "author": "Butler Lampson",
    "content": "Everything should be made as simple as possible. But to do that you have to master complexity."
  },
  {
    "author": "Wayne Ratliff",
    "content": "If I had followed my heart instead of advice, dBASE would be much closer to perfection today."
  },
  {
    "author": "Wayne Ratliff",
    "content": "Programming is a little bit like the army. Now that I'm out, it's neat to have had the experience."
  },
  {
    "author": "Jonathan Sachs",
    "content": "I don't like using any tools or programs I didn't write myself or that I don't have some control over."
  },
  {
    "author": "Bob Frankston",
    "content": "If you cannot explain a program to yourself, the chance of the\ncomputer getting it right is pretty small."
  },
  {
    "author": "Gary Kildall",
    "content": "I don't comment on the code itself because I feel that properly written code is very much self-documented."
  },
  {
    "author": "Gary Kildall",
    "content": "When a program is clean and neat, nicely structured, and consistent, it can be beautiful."
  },
  {
    "author": "Douglas Crockford",
    "content": "JavaScript, purely by accident, has become the most popular programming language in the world."
  },
  {
    "author": "L. Peter Deutsch",
    "content": "Software is a discipline of detail, and that is a deep, horrendous fundamental problem with software."
  },
  {
    "author": "Gottfried Wilhelm Leibniz",
    "content": "Even in the games of children there are things to interest the greatest mathematician."
  },

  {
    "content": "The Superior Man is aware of Righteousness, the inferior man is aware of advantage.",
    "author": "Confucius"
  },
  {
    "content": "America's freedom of religion, and freedom from religion, offers every wisdom tradition an opportunity to address our soul-deep needs: Christianity, Judaism, Islam, Buddhism, Hinduism, secular humanism, agnosticism and atheism among others.",
    "author": "Parker Palmer"
  },
  {
    "content": "Myths which are believed in tend to become true.",
    "author": "George Orwell"
  },
  {
    "content": "In all chaos there is a cosmos, in all disorder a secret order.",
    "author": "Carl Jung"
  },
  {
    "content": "Be courteous to all, but intimate with few, and let those few be well tried before you give them your confidence.",
    "author": "George Washington"
  },
  {
    "content": "If you break your neck, if you have nothing to eat, if your house is on fire, then you got a problem. Everything else is inconvenience.",
    "author": "Robert Fulghum"
  },
  {
    "content": "The past has no power to stop you from being present now. Only your grievance about the past can do that.",
    "author": "Eckhart Tolle"
  },
  {
    "content": "There is nothing happens to any person but what was in his power to go through with.",
    "author": "Marcus Aurelius"
  },
  {
    "content": "The smallest act of kindness is worth more than the grandest intention.",
    "author": "Oscar Wilde"
  },
  {
    "content": "Every problem has a gift for you in its hands.",
    "author": "Richard Bach"
  },
  {
    "content": "The greatest minds are capable of the greatest vices as well as of the greatest virtues.",
    "author": "René Descartes"
  },
  {
    "content": "The world makes way for the man who knows where he is going.",
    "author": "Ralph Waldo Emerson"
  },
  {
    "content": "You are a product of your environment. So choose the environment that will best develop you toward your objective. Analyze your life in terms of its environment. Are the things around you helping you toward success - or are they holding you back?",
    "author": "W. Clement Stone"
  },
  {
    "content": "The cautious seldom err.",
    "author": "Confucius"
  },
  {
    "content": "The most complicated achievements of thought are possible without the assistance of consciousness.",
    "author": "Sigmund Freud"
  },
  {
    "content": "As we express our gratitude, we must never forget that the highest appreciation is not to utter words, but to live by them.",
    "author": "John F. Kennedy"
  },
  {
    "content": "The greatest way to live with honor in this world is to be what we pretend to be.",
    "author": "Socrates"
  },
  {
    "content": "Every person, all the events of your life are there because you have drawn them there. What you choose to do with them is up to you.",
    "author": "Richard Bach"
  },
  {
    "content": "Wisdom begins at the end.",
    "author": "Daniel Webster"
  },
  {
    "content": "Ignorant men don't know what good they hold in their hands until they've flung it away.",
    "author": "Sophocles"
  },
  {
    "content": "However many holy words you read, however many you speak, what good will they do you if you do not act on upon them?",
    "author": "Buddha"
  },
  {
    "content": "Science gives us knowledge, but only philosophy can give us wisdom.",
    "author": "Will Durant"
  },
  {
    "content": "A passion for politics stems usually from an insatiable need, either for power, or for friendship and adulation, or a combination of both.",
    "author": "Fawn M. Brodie"
  },
  {
    "content": "Be not angry that you cannot make others as you wish them to be, since you cannot make yourself as you wish to be.",
    "author": "Thomas à Kempis"
  },
  {
    "content": "No one can make you feel inferior without your consent.",
    "author": "Eleanor Roosevelt"
  },
  {
    "content": "Appreciation can make a day, even change a life. Your willingness to put it into words is all that is necessary.",
    "author": "Margaret Cousins"
  },
  {
    "content": "Much wisdom often goes with fewest words.",
    "author": "Sophocles"
  },
  {
    "content": "Joy is the best makeup.",
    "author": "Anne Lamott"
  },
  {
    "content": "There never was a good knife made of bad steel.",
    "author": "Benjamin Franklin"
  },
  {
    "content": "I love my past. I love my present. Im not ashamed of what Ive had, and Im not sad because I have it no longer.",
    "author": "Colette"
  },
  {
    "content": "There is a difference between happiness and wisdom: he that thinks himself the happiest man is really so; but he that thinks himself the wisest is generally the greatest fool.",
    "author": "Francis Bacon"
  },
  {
    "content": "To free us from the expectations of others, to give us back to ourselves... there lies the great, singular power of self-respect.",
    "author": "Joan Didion"
  },
  {
    "content": "The power of intuitive understanding will protect you from harm until the end of your days.",
    "author": "Laozi"
  },
  {
    "content": "Never explain - your friends do not need it and your enemies will not believe you anyway.",
    "author": "Elbert Hubbard"
  },
  {
    "content": "Discipline is the bridge between goals and accomplishment.",
    "author": "Jim Rohn"
  },
  {
    "content": "It is not only for what we do that we are held responsible, but also for what we do not do.",
    "author": "Molière"
  },
  {
    "content": "All difficult things have their origin in that which is easy, and great things in that which is small.",
    "author": "Laozi"
  },
  {
    "content": "It requires wisdom to understand wisdom: the music is nothing if the audience is deaf.",
    "author": "Walter Lippmann"
  },
  {
    "content": "So is cheerfulness, or a good temper, the more it is spent, the more remains.",
    "author": "Ralph Waldo Emerson"
  },
  {
    "content": "Trust yourself. You know more than you think you do.",
    "author": "Benjamin Spock"
  },
  {
    "content": "Never promise more than you can perform.",
    "author": "Publilius Syrus"
  },
  {
    "content": "Formula for success: under promise and over deliver.",
    "author": "Tom Peters"
  },
  {
    "content": "The only limit to our realization of tomorrow will be our doubts of today.",
    "author": "Franklin D. Roosevelt"
  },
  {
    "content": "I think people who are creative are the luckiest people on earth. I know that there are no shortcuts, but you must keep your faith in something Greater than You, and keep doing what you love. Do what you love, and you will find the way to get it out to the world.",
    "author": "Judy Collins"
  },
  {
    "content": "The possibilities are numerous once we decide to act and not react.",
    "author": "George Bernard Shaw"
  },
  {
    "content": "It is better to have enough ideas for some of them to be wrong, than to be always right by having no ideas at all.",
    "author": "Edward de Bono"
  },
  {
    "content": "The most I can do for my friend is simply be his friend.",
    "author": "Henry David Thoreau"
  },
  {
    "content": "Every one in the world ought to do the things for which he is specially adapted. It is the part of wisdom to recognize what each one of us is best fitted for, and it is the part of education to perfect and utilize such predispositions. Because education can direct and aid nature but can never transform her.",
    "author": "Maria Montessori"
  },
  {
    "content": "He who lives in harmony with himself lives in harmony with the world.",
    "author": "Marcus Aurelius"
  },
  {
    "content": "The first requisite for success is the ability to apply your physical and mental energies to one problem incessantly without growing weary.",
    "author": "Thomas Edison"
  },
  {
    "content": "Go for it now. The future is promised to no one.",
    "author": "Wayne Dyer"
  },
  {
    "content": "To wear your heart on your sleeve isn't a very good plan; you should wear it inside, where it functions best.",
    "author": "Margaret Thatcher"
  },
  {
    "content": "You win the victory when you yield to friends.",
    "author": "Sophocles"
  },
  {
    "content": "He that never changes his opinions, never corrects his mistakes, and will never be wiser on the morrow than he is today.",
    "author": "Tryon Edwards"
  },
  {
    "content": "Not what we have but what we enjoy constitutes our abundance.",
    "author": "Jean Antoine Petit-Senn"
  },
  {
    "content": "Never tell people how to do things. Tell them what to do and they will surprise you with their ingenuity.",
    "author": "George S. Patton"
  },
  {
    "content": "A really great talent finds its happiness in execution.",
    "author": "Johann Wolfgang von Goethe"
  },
  {
    "content": "Wisdom comes alone through suffering.",
    "author": "Aeschylus"
  },
  {
    "content": "Every time you smile at someone, it is an action of love, a gift to that person, a beautiful thing.",
    "author": "Mother Teresa"
  },
  {
    "content": "Marriage: A friendship recognized by the police.",
    "author": "Robert Louis Stevenson"
  },
  {
    "content": "If I am not for myself, who will be for me? If I am not for others, what am I? And if not now, when?",
    "author": "Rabbi Hillel"
  },
  {
    "content": "If you aren't going all the way, why go at all?",
    "author": "Joe Namath"
  },
  {
    "content": "To go against the dominant thinking of your friends, of most of the people you see every day, is perhaps the most difficult act of heroism you can perform.",
    "author": "Theodore H. White"
  },
  {
    "content": "Success is not the key to happiness. Happiness is the key to success. If you love what you are doing, you will be successful.",
    "author": "Albert Schweitzer"
  },
  {
    "content": "Always remember that you are absolutely unique. Just like everyone else.",
    "author": "Margaret Mead"
  },
  {
    "content": "If you have the guts to keep making mistakes, your wisdom and intelligence leap forward with huge momentum.",
    "author": "Holly Near"
  },
  {
    "content": "Success in business requires training and discipline and hard work. But if you're not frightened by these things, the opportunities are just as great today as they ever were.",
    "author": "David Rockefeller"
  },
  {
    "content": "No man was ever wise by chance.",
    "author": "Seneca the Younger"
  },
  {
    "content": "Nothing ever goes away until it has taught us what we need to know.",
    "author": "Pema Chödrön"
  },
  {
    "content": "The more man meditates upon good thoughts, the better will be his world and the world at large.",
    "author": "Confucius"
  },
  {
    "content": "We can only learn to love by loving.",
    "author": "Iris Murdoch"
  },
  {
    "content": "The only thing to do with good advice is to pass it on. It is never of any use to oneself.",
    "author": "Oscar Wilde"
  },
  {
    "content": "Our shared values define us more than our differences. And acknowledging those shared values can see us through our challenges today if we have the wisdom to trust in them again.",
    "author": "John McCain"
  },
  {
    "content": "If you change the way you look at things, the things you look at change.",
    "author": "Wayne Dyer"
  },
  {
    "content": "There are two kinds of failures: those who thought and never did, and those who did and never thought.",
    "author": "Laurence J. Peter"
  },
  {
    "content": "If you don't know where you are going, any road will get you there.",
    "author": "Lewis Carroll"
  },
  {
    "content": "Happiness is a perfume you cannot pour on others without getting a few drops on yourself.",
    "author": "Ralph Waldo Emerson"
  },
  {
    "content": "Wisdom is found only in truth.",
    "author": "Johann Wolfgang von Goethe"
  },
  {
    "content": "There is nothing on this earth more to be prized than true friendship.",
    "author": "Thomas Aquinas"
  },
  {
    "content": "To get the full value of joy you must have someone to divide it with.",
    "author": "Mark Twain"
  },
  {
    "content": "The art of storytelling is reaching its end because the epic side of truth, wisdom, is dying out.",
    "author": "Walter Benjamin"
  },
  {
    "content": "Our distrust is very expensive.",
    "author": "Ralph Waldo Emerson"
  },
  {
    "content": "The things that one most wants to do are the things that are probably most worth doing.",
    "author": "Winifred Holtby"
  },
  {
    "content": "Learning is the beginning of wealth. Learning is the beginning of health. Learning is the beginning of spirituality. Searching and learning is where the miracle process all begins.",
    "author": "Jim Rohn"
  },
  {
    "content": "First say to yourself what you would be; and then do what you have to do.",
    "author": "Epictetus"
  },
  {
    "content": "When you doubt your power, you give power to your doubt.",
    "author": "Honoré de Balzac"
  },
  {
    "content": "It is not so important to know everything as to appreciate what we learn.",
    "author": "Hannah More"
  },
  {
    "content": "Keep yourself to the sunshine and you cannot see the shadow.",
    "author": "Helen Keller"
  },
  {
    "content": "Nobody made a greater mistake than he who did nothing because he could do only a little.",
    "author": "Edmund Burke"
  },
  {
    "content": "The foolish man seeks happiness in the distance, the wise grows it under his feet.",
    "author": "James Oppenheim"
  },
  {
    "content": "There is no friendship, no love, like that of the parent for the child.",
    "author": "Henry Ward Beecher"
  },
  {
    "content": "Begin, be bold, and venture to be wise.",
    "author": "Horace"
  },
  {
    "content": "A true friend is the most precious of all possessions and the one we take the least thought about acquiring.",
    "author": "François de La Rochefoucauld"
  },
  {
    "content": "Our greatness lies not so much in being able to remake the world as being able to remake ourselves.",
    "author": "Mahatma Gandhi"
  },
  {
    "content": "It is impossible to love and to be wise.",
    "author": "Francis Bacon"
  },
  {
    "content": "The sincere friends of this world are as ship lights in the stormiest of nights.",
    "author": "Giotto"
  },
  {
    "content": "He that respects himself is safe from others; he wears a coat of mail that none can pierce.",
    "author": "Henry Wadsworth Longfellow"
  },
  {
    "content": "To bring anything into your life, imagine that it's already there.",
    "author": "Richard Bach"
  },
  {
    "content": "The thought manifests as the word. The word manifests as the deed. The deed develops into habit. And the habit hardens into character.",
    "author": "Buddha"
  },
  {
    "content": "So much technology, so little talent.",
    "author": "Vernor Vinge"
  },
  {
    "content": "Do not follow where the path may lead. Go, instead, where there is no path and leave a trail.",
    "author": "Ralph Waldo Emerson"
  },
  {
    "content": "True friendship multiplies the good in life and divides its evils. Strive to have friends, for life without friends is like life on a desert island... to find one real friend in a lifetime is good fortune; to keep him is a blessing.",
    "author": "Baltasar Gracián"
  },
  {
    "content": "Mistakes are the usual bridge between inexperience and wisdom.",
    "author": "Phyllis Grissim-Theroux"
  },
  {
    "content": "Those who dare to fail miserably can achieve greatly.",
    "author": "John F. Kennedy"
  },
  {
    "content": "Until you value yourself, you won't value your time. Until you value your time, you won't do anything with it.",
    "author": "M. Scott Peck"
  },
  {
    "content": "The road of excess leads to the palace of wisdom.",
    "author": "William Blake"
  },
  {
    "content": "When we feel love and kindness toward others, it not only makes others feel loved and cared for, but it helps us also to develop inner happiness and peace.",
    "author": "Dalai Lama"
  },
  {
    "content": "And as we let our own light shine, we unconsciously give other people permission to do the same.",
    "author": "Nelson Mandela"
  },
  {
    "content": "No act of kindness, no matter how small, is ever wasted.",
    "author": "Aesop"
  },
  {
    "content": "We aim above the mark to hit the mark.",
    "author": "Ralph Waldo Emerson"
  },
  {
    "content": "Do something wonderful, people may imitate it.",
    "author": "Albert Schweitzer"
  },
  {
    "content": "A man is great by deeds, not by birth.",
    "author": "Chanakya"
  },
  {
    "content": "It has become appallingly obvious that our technology has exceeded our humanity.",
    "author": "Albert Einstein"
  },
  {
    "content": "Most of the shadows of life are caused by standing in our own sunshine.",
    "author": "Ralph Waldo Emerson"
  },
  {
    "content": "Know that although in the eternal scheme of things you are small, you are also unique and irreplaceable, as are all your fellow humans everywhere in the world.",
    "author": "Margaret Laurence"
  },
  {
    "content": "When I dare to be powerful, to use my strength in the service of my vision, then it becomes less and less important whether I am afraid.",
    "author": "Audre Lorde"
  },
  {
    "content": "Think for yourselves and let others enjoy the privilege to do so too.",
    "author": "Voltaire"
  },
  {
    "content": "Every gift from a friend is a wish for your happiness.",
    "author": "Richard Bach"
  },
  {
    "content": "There are two primary choices in life: to accept conditions as they exist, or accept responsibility for changing them.",
    "author": "Denis Waitley"
  },
  {
    "content": "Genius unrefined resembles a flash of lightning, but wisdom is like the sun.",
    "author": "Franz Grillparzer"
  },
  {
    "content": "Tragedy is a tool for the living to gain wisdom, not a guide by which to live.",
    "author": "Robert F. Kennedy"
  },
  {
    "content": "He who is taught to live upon little owes more to his father's wisdom than he who has a great deal left him does to his father's care.",
    "author": "William C. Menninger"
  },
  {
    "content": "Accept challenges, so that you may feel the exhilaration of victory.",
    "author": "George S. Patton"
  },
  {
    "content": "Friendship is Love without his wings!",
    "author": "Lord Byron"
  },
  {
    "content": "True friends stab you in the front.",
    "author": "Oscar Wilde"
  },
  {
    "content": "Value your friendship. Value your relationships.",
    "author": "Barbara Bush"
  },
  {
    "content": "There is never enough time to do everything, but there is always enough time to do the most important thing.",
    "author": "Brian Tracy"
  },
  {
    "content": "Life isn't about finding yourself. Life is about creating yourself.",
    "author": "Bernard Shaw"
  },
  {
    "content": "No one has a finer command of language than the person who keeps his mouth shut.",
    "author": "Sam Rayburn"
  },
  {
    "content": "All that is necessary is to accept the impossible, do without the indispensable, and bear the intolerable.",
    "author": "Kathleen Norris"
  },
  {
    "content": "He who knows, does not speak. He who speaks, does not know.",
    "author": "Laozi"
  },
  {
    "content": "In the depth of winter, I finally learned that there was within me an invincible summer.",
    "author": "Albert Camus"
  },
  {
    "content": "You can always tell a real friend: when you've made a fool of yourself he doesn't feel you've done a permanent job.",
    "author": "Laurence J. Peter"
  },
  {
    "content": "True knowledge exists in knowing that you know nothing.",
    "author": "Isocrates"
  },
  {
    "content": "To keep the body in good health is a duty... otherwise we shall not be able to keep our mind strong and clear.",
    "author": "Buddha"
  },
  {
    "content": "We need to find the courage to say NO to the things and people that are not serving us if we want to rediscover ourselves and live our lives with authenticity.",
    "author": "Barbara De Angelis"
  },
  {
    "content": "Be the chief but never the lord.",
    "author": "Laozi"
  },
  {
    "content": "Love all, trust a few, do wrong to none.",
    "author": "William Shakespeare"
  },
  {
    "content": "The more you know yourself, the more you forgive yourself.",
    "author": "Confucius"
  },
  {
    "content": "Do good by stealth, and blush to find it fame.",
    "author": "Alexander Pope"
  },
  {
    "content": "Build a better mousetrap and the world will beat a path to your door.",
    "author": "Ralph Waldo Emerson"
  },
  {
    "content": "Make the most of yourself, for that is all there is of you.",
    "author": "Ralph Waldo Emerson"
  },
  {
    "content": "In wisdom gathered over time I have found that every experience is a form of exploration.",
    "author": "Ansel Adams"
  },
  {
    "content": "Chance is always powerful. Let your hook be always cast; in the pool where you least expect it, there will be a fish.",
    "author": "Ovid"
  },
  {
    "content": "I can, therefore I am.",
    "author": "Simone Weil"
  },
  {
    "content": "The only real valuable thing is intuition.",
    "author": "Albert Einstein"
  },
  {
    "content": "Some people go to priests; others to poetry; I to my friends.",
    "author": "Virginia Woolf"
  },
  {
    "content": "Liberty, taking the word in its concrete sense, consists in the ability to choose.",
    "author": "Simone Weil"
  },
  {
    "content": "If we are not fully ourselves, truly in the present moment, we miss everything.",
    "author": "Thích Nhất Hạnh"
  },
  {
    "content": "I allow my intuition to lead my path.",
    "author": "Manuel Puig"
  },
  {
    "content": "You can stand tall without standing on someone. You can be a victor without having victims.",
    "author": "Harriet Woods"
  },
  {
    "content": "Loyalty and friendship, which is to me the same, created all the wealth that I've ever thought I'd have.",
    "author": "Ernie Banks"
  },
  {
    "content": "Wisdom is oftentimes nearer when we stoop than when we soar.",
    "author": "William Wordsworth"
  },
  {
    "content": "Whoever is happy will make others happy, too.",
    "author": "Mark Twain"
  },
  {
    "content": "Two persons cannot long be friends if they cannot forgive each other's little failings.",
    "author": "Jean de La Bruyère"
  },
  {
    "content": "The supreme art of war is to subdue the enemy without fighting.",
    "author": "Sun Tzu"
  },
  {
    "content": "Wise men talk because they have something to say; fools, because they have to say something.",
    "author": "Plato"
  },
  {
    "content": "I believe that we are fundamentally the same and have the same basic potential.",
    "author": "Dalai Lama"
  },
  {
    "content": "Cherish your visions and your dreams as they are the children of your soul; the blueprints of your ultimate achievements.",
    "author": "Napoleon Hill"
  },
  {
    "content": "Everything that irritates us about others can lead us to a better understanding of ourselves.",
    "author": "Carl Jung"
  },
  {
    "content": "The truest wisdom is a resolute determination.",
    "author": "Napoleon"
  },
  {
    "content": "All men have a sweetness in their life. That is what helps them go on. It is towards that they turn when they feel too worn out.",
    "author": "Albert Camus"
  },
  {
    "content": "To dare is to lose ones footing momentarily. To not dare is to lose oneself.",
    "author": "Søren Kierkegaard"
  },
  {
    "content": "Arriving at one point is the starting point to another.",
    "author": "John Dewey"
  },
  {
    "content": "The least of things with a meaning is worth more in life than the greatest of things without it.",
    "author": "Carl Jung"
  },
  {
    "content": "The awareness of our own strength makes us modest.",
    "author": "Paul Cézanne"
  },
  {
    "content": "Kind words do not cost much. Yet they accomplish much.",
    "author": "Blaise Pascal"
  },
  {
    "content": "To hell with circumstances; I create opportunities.",
    "author": "Bruce Lee"
  },
  {
    "content": "Love is never lost. If not reciprocated, it will flow back and soften and purify the heart.",
    "author": "Washington Irving"
  },
  {
    "content": "You must welcome change as the rule but not as your ruler.",
    "author": "Denis Waitley"
  },
  {
    "content": "Love cures people - both the ones who give it and the ones who receive it.",
    "author": "Karl Menninger"
  },
  {
    "content": "Opportunity often comes disguised in the form of misfortune, or temporary defeat.",
    "author": "Napoleon Hill"
  },
  {
    "content": "Never idealize others. They will never live up to your expectations.",
    "author": "Leo Buscaglia"
  },
  {
    "content": "To be aware of a single shortcoming in oneself is more useful than to be aware of a thousand in someone else.",
    "author": "Dalai Lama"
  },
  {
    "content": "Anyone who doesn't take truth seriously in small matters cannot be trusted in large ones either.",
    "author": "Albert Einstein"
  },
  {
    "content": "Accept the things to which fate binds you, and love the people with whom fate brings you together, but do so with all your heart.",
    "author": "Marcus Aurelius"
  },
  {
    "content": "Do you want to know who you are? Don't ask. Act! Action will delineate and define you.",
    "author": "Thomas Jefferson"
  },
  {
    "content": "Motivation is the art of getting people to do what you want them to do because they want to do it.",
    "author": "Dwight D. Eisenhower"
  },
  {
    "content": "All love that has not friendship for its base, is like a mansion built upon the sand.",
    "author": "Ella Wheeler Wilcox"
  },
  {
    "content": "The more you like yourself, the less you are like anyone else, which makes you unique.",
    "author": "Walt Disney"
  },
  {
    "content": "Constant kindness can accomplish much. As the sun makes ice melt, kindness causes misunderstanding, mistrust, and hostility to evaporate.",
    "author": "Albert Schweitzer"
  },
  {
    "author": "William Shakespeare",
    "content": "Action is eloquence!"
  },
  {
    "content": "The heart has its reasons which reason knows not of.",
    "author": "Blaise Pascal"
  },
  {
    "content": "Good people are good because they've come to wisdom through failure. We get very little wisdom from success, you know.",
    "author": "William Saroyan"
  },
  {
    "content": "If you're walking down the right path and you're willing to keep walking, eventually you'll make progress.",
    "author": "Barack Obama"
  },
  {
    "content": "Do not wait; the time will never be 'just right.' Start where you stand, and work with whatever tools you may have at your command, and better tools will be found as you go along.",
    "author": "George Herbert"
  },
  {
    "content": "It is better to understand a little than to misunderstand a lot.",
    "author": "Anatole France"
  },
  {
    "content": "Let us sacrifice our today so that our children can have a better tomorrow.",
    "author": "A. P. J. Abdul Kalam"
  },
  {
    "content": "A youth, when at home, should be filial and, abroad, respectful to his elders. He should be earnest and truthful. He should overflow in love to all and cultivate the friendship of the good. When he has time and opportunity, after the performance of these things, he should employ them in polite studies.",
    "author": "Confucius"
  },
  {
    "content": "I love you the more in that I believe you had liked me for my own sake and for nothing else.",
    "author": "John Keats"
  },
  {
    "content": "Read as you taste fruit or savor wine, or enjoy friendship, love or life.",
    "author": "George Herbert"
  },
  {
    "content": "If you do what you've always done, you'll get what youve always gotten.",
    "author": "Tony Robbins"
  },
  {
    "content": "Respect should be earned by actions, and not acquired by years.",
    "author": "Frank Lloyd Wright"
  },
  {
    "content": "Bodily exercise, when compulsory, does no harm to the body; but knowledge which is acquired under compulsion obtains no hold on the mind.",
    "author": "Plato"
  },
  {
    "content": "Do not be too timid and squeamish about your reactions. All life is an experiment. The more experiments you make the better.",
    "author": "Ralph Waldo Emerson"
  },
  {
    "content": "The universe is full of magical things, patiently waiting for our wits to grow sharper.",
    "author": "Eden Phillpotts"
  },
  {
    "content": "Where is the Life we have lost in living? Where is the wisdom we have lost in knowledge? Where is the knowledge we have lost in information?",
    "author": "George Eliot"
  },
  {
    "content": "Friendship is always a sweet responsibility, never an opportunity.",
    "author": "Kahlil Gibran"
  },
  {
    "content": "The winds and waves are always on the side of the ablest navigators.",
    "author": "Edward Gibbon"
  },
  {
    "content": "There is only one success - to be able to spend your life in your own way.",
    "author": "Christopher Morley"
  },
  {
    "content": "Whoso loves, believes the impossible.",
    "author": "Elizabeth Browning"
  },
  {
    "content": "Reality is merely an illusion, albeit a very persistent one.",
    "author": "Albert Einstein"
  },
  {
    "content": "If you love life, don't waste time, for time is what life is made up of.",
    "author": "Bruce Lee"
  },
  {
    "content": "The most difficult thing is the decision to act, the rest is merely tenacity. The fears are paper tigers. You can do anything you decide to do. You can act to change and control your life; and the procedure, the process is its own reward.",
    "author": "Amelia Earhart"
  },
  {
    "content": "Do what you can. Want what you have. Be who you are.",
    "author": "Forrest Church"
  },
  {
    "content": "Mind is everything: muscle, pieces of rubber. All that I am, I am because of my mind.",
    "author": "Paavo Nurmi"
  },
  {
    "content": "We come to love not by finding a perfect person, but by learning to see an imperfect person perfectly.",
    "author": "Sam Keen"
  },
  {
    "content": "A tree is known by its fruit; a man by his deeds. A good deed is never lost; he who sows courtesy reaps friendship, and he who plants kindness gathers love.",
    "author": "Basil of Caesarea"
  },
  {
    "content": "What is new in the world? Nothing. What is old in the world? Nothing. Everything has always been and will always be.",
    "author": "Sai Baba"
  },
  {
    "content": "It is more shameful to distrust our friends than to be deceived by them.",
    "author": "Confucius"
  },
  {
    "content": "Everything has beauty, but not everyone sees it.",
    "author": "Confucius"
  },
  {
    "content": "Learn from yesterday, live for today, hope for tomorrow.",
    "author": "Albert Einstein"
  },
  {
    "content": "He who talks more is sooner exhausted.",
    "author": "Laozi"
  },
  {
    "content": "If there is such a thing as a good marriage, it is because it resembles friendship rather than love.",
    "author": "Michel de Montaigne"
  },
  {
    "content": "If a man does his best, what else is there?",
    "author": "George S. Patton"
  },
  {
    "content": "Fine words and an insinuating appearance are seldom associated with true virtue",
    "author": "Confucius"
  },
  {
    "content": "Your talent is God's gift to you. What you do with it is your gift back to God.",
    "author": "Leo Buscaglia"
  },
  {
    "content": "Quick decisions are unsafe decisions.",
    "author": "Sophocles"
  },
  {
    "content": "To fly as fast as thought, you must begin by knowing that you have already arrived.",
    "author": "Richard Bach"
  },
  {
    "content": "Better be ignorant of a matter than half know it.",
    "author": "Publilius Syrus"
  },
  {
    "content": "I destroy my enemies when I make them my friends.",
    "author": "Abraham Lincoln"
  },
  {
    "content": "Autumn is a second spring when every leaf is a flower.",
    "author": "Albert Camus"
  },
  {
    "content": "Life is a learning experience, only if you learn.",
    "author": "Yogi Berra"
  },
  {
    "content": "Happiness is when what you think, what you say, and what you do are in harmony.",
    "author": "Mahatma Gandhi"
  },
  {
    "content": "Without passion man is a mere latent force and possibility, like the flint which awaits the shock of the iron before it can give forth its spark.",
    "author": "Henri-Frédéric Amiel"
  },
  {
    "content": "Your mind will answer most questions if you learn to relax and wait for the answer.",
    "author": "William Burroughs"
  },
  {
    "content": "Pure, holy simplicity confounds all the wisdom of this world and the wisdom of the flesh.",
    "author": "Francis of Assisi"
  },
  {
    "content": "The less effort, the faster and more powerful you will be.",
    "author": "Bruce Lee"
  },
  {
    "content": "If I know what love is, it is because of you.",
    "author": "Hermann Hesse"
  },
  {
    "content": "Life is not a problem to be solved, but a reality to be experienced.",
    "author": "Søren Kierkegaard"
  },
  {
    "content": "I decided that it was not wisdom that enabled poets to write their poetry, but a kind of instinct or inspiration, such as you find in seers and prophets who deliver all their sublime messages without knowing in the least what they mean.",
    "author": "Isocrates"
  },
  {
    "content": "Communications tools don’t get socially interesting until they get technologically boring.",
    "author": "Clay Shirky"
  },
  {
    "content": "If you accept the expectations of others, especially negative ones, then you never will change the outcome.",
    "author": "Michael Jordan"
  },
  {
    "content": "The way you see people is the way you treat them, and the way you treat them is what they become.",
    "author": "Johann Wolfgang von Goethe"
  },
  {
    "content": "He is able who thinks he is able.",
    "author": "Buddha"
  },
  {
    "content": "The only real mistake is the one from which we learn nothing.",
    "author": "John Powell"
  },
  {
    "content": "There is only one corner of the universe you can be certain of improving, and that's your own self.",
    "author": "Aldous Huxley"
  },
  {
    "content": "All children are artists. The problem is how to remain an artist once he grows up.",
    "author": "Pablo Picasso"
  },
  {
    "content": "Friendship is the marriage of the soul, and this marriage is liable to divorce.",
    "author": "Voltaire"
  },
  {
    "content": "The pain passes, but the beauty remains.",
    "author": "Pierre-Auguste Renoir"
  },
  {
    "content": "An ant on the move does more than a dozing ox",
    "author": "Laozi"
  },
  {
    "content": "Loss is nothing else but change,and change is Natures delight.",
    "author": "Marcus Aurelius"
  },
  {
    "content": "Listen to what you know instead of what you fear.",
    "author": "Richard Bach"
  },
  {
    "content": "Always seek out the seed of triumph in every adversity.",
    "author": "Og Mandino"
  },
  {
    "content": "Men in general judge more from appearances than from reality. All men have eyes, but few have the gift of penetration.",
    "author": "Niccolò Machiavelli"
  },
  {
    "content": "Thought is the blossom; language the bud; action the fruit behind it.",
    "author": "Ralph Waldo Emerson"
  },
  {
    "content": "The place to improve the world is first in one's own heart and head and hands.",
    "author": "Robert M. Pirsig"
  },
  {
    "content": "To be tested is good. The challenged life may be the best therapist.",
    "author": "Gail Sheehy"
  },
  {
    "content": "Your sacred space is where you can find yourself again and again.",
    "author": "Joseph Campbell"
  },
  {
    "content": "Study the past, if you would divine the future.",
    "author": "Confucius"
  },
  {
    "content": "Four steps to achievement: Plan purposefully. Prepare prayerfully. Proceed positively. Pursue persistently.",
    "author": "William Arthur Ward"
  },
  {
    "content": "It is not the possession of truth, but the success which attends the seeking after it, that enriches the seeker and brings happiness to him.",
    "author": "Max Planck"
  },
  {
    "content": "Great ideas often receive violent opposition from mediocre minds.",
    "author": "Albert Einstein"
  },
  {
    "content": "Man is not sum of what he has already, but rather the sum of what he does not yet have, of what he could have.",
    "author": "Jean-Paul Sartre"
  },
  {
    "content": "Sincerity is the way of Heaven. The attainment of sincerity is the way of men.",
    "author": "Confucius"
  },
  {
    "content": "Happiness is not something ready made. It comes from your own actions.",
    "author": "Dalai Lama"
  },
  {
    "content": "If you wish to be a writer, write.",
    "author": "Epictetus"
  },
  {
    "content": "In action a great heart is the chief qualification. In work, a great head.",
    "author": "Arthur Schopenhauer"
  },
  {
    "content": "I find hope in the darkest of days, and focus in the brightest. I do not judge the universe.",
    "author": "Dalai Lama"
  },
  {
    "content": "The greatest danger for most of us is not that our aim is too high and we miss it, but that it is too low and we reach it.",
    "author": "Michelangelo"
  },
  {
    "content": "We are all inclined to judge ourselves by our ideals; others, by their acts.",
    "author": "Harold Nicolson"
  },
  {
    "content": "Technology has to be invented or adopted.",
    "author": "Jared Diamond"
  },
  {
    "content": "Kind words can be short and easy to speak, but their echoes are truly endless.",
    "author": "Mother Teresa"
  },
  {
    "content": "Your vision will become clear only when you look into your heart. Who looks outside, dreams. Who looks inside, awakens.",
    "author": "Carl Jung"
  },
  {
    "content": "When the solution is simple, God is answering.",
    "author": "Albert Einstein"
  },
  {
    "content": "You can't cross the sea merely by standing and staring at the water.",
    "author": "Rabindranath Tagore"
  },
  {
    "content": "An idea that is developed and put into action is more important than an idea that exists only as an idea.",
    "author": "Buddha"
  },
  {
    "content": "Technology… the knack of so arranging the world that we don’t have to experience it.",
    "author": "Max Frisch"
  },
  {
    "content": "Friendship is the source of the greatest pleasures, and without friends even the most agreeable pursuits become tedious.",
    "author": "Thomas Aquinas"
  },
  {
    "content": "Nothing in life is to be feared, it is only to be understood. Now is the time to understand more, so that we may fear less.",
    "author": "Marie Curie"
  },
  {
    "content": "One's philosophy is not best expressed in words; it is expressed in the choices one makes... and the choices we make are ultimately our responsibility.",
    "author": "Eleanor Roosevelt"
  },
  {
    "content": "The invariable mark of wisdom is to see the miraculous in the common.",
    "author": "Ralph Waldo Emerson"
  },
  {
    "content": "Many of life's failures are people who did not realize how close they were to success when they gave up.",
    "author": "Thomas Edison"
  },
  {
    "content": "To give ones self earnestly to the duties due to men, and, while respecting spiritual beings, to keep aloof from them, may be called wisdom.",
    "author": "Confucius"
  },
  {
    "content": "The smallest flower is a thought, a life answering to some feature of the Great Whole, of whom they have a persistent intuition.",
    "author": "Honoré de Balzac"
  },
  {
    "content": "In all things of nature there is something of the marvelous.",
    "author": "Aristotle"
  },
  {
    "content": "Friendship, like credit, is highest when it is not used.",
    "author": "Elbert Hubbard"
  },
  {
    "content": "Know what's important and what isn't. Have the wisdom to know the right thing to do, the integrity to do it, the character to stand up to those who don't, and the courage to stop those who won't.",
    "author": "Mark Goulston"
  },
  {
    "content": "There is no charm equal to tenderness of heart.",
    "author": "Jane Austen"
  },
  {
    "content": "We don't receive wisdom; we must discover it for ourselves after a journey that no one can take for us or spare us.",
    "author": "Marcel Proust"
  },
  {
    "content": "It always seems impossible until it's done.",
    "author": "Nelson Mandela"
  },
  {
    "content": "Well done is better than well said.",
    "author": "Benjamin Franklin"
  },
  {
    "content": "Lose an hour in the morning, and you will spend all day looking for it.",
    "author": "Richard Whately"
  },
  {
    "content": "If you want to go east, don't go west.",
    "author": "Ramakrishna"
  },
  {
    "content": "We never understand how little we need in this world until we know the loss of it.",
    "author": "J. M. Barrie"
  },
  {
    "content": "Hope arouses, as nothing else can arouse, a passion for the possible.",
    "author": "William Sloane Coffin"
  },
  {
    "content": "I will prepare and some day my chance will come.",
    "author": "Abraham Lincoln"
  },
  {
    "content": "We make a living by what we get, but we make a life by what we give.",
    "author": "Winston Churchill"
  },
  {
    "content": "I define friendship as a bond that transcends all barriers. When you are ready to expect anything and everything from friends, good, bad or ugly... that's what I call true friendship.",
    "author": "Harbhajan Singh"
  },
  {
    "content": "The more sand that has escaped from the hourglass of our life, the clearer we should see through it.",
    "author": "Jean-Paul Sartre"
  },
  {
    "content": "Trust only movement. Life happens at the level of events, not of words. Trust movement.",
    "author": "Alfred Adler"
  },
  {
    "content": "You cannot travel the path until you have become the path itself.",
    "author": "Buddha"
  },
  {
    "content": "Of course there is no formula for success except perhaps an unconditional acceptance of life and what it brings.",
    "author": "Arthur Rubinstein"
  },
  {
    "content": "There is nothing so useless as doing efficiently that which should not be done at all.",
    "author": "Peter Drucker"
  },
  {
    "content": "Im not in this world to live up to your expectations and you're not in this world to live up to mine.",
    "author": "Bruce Lee"
  },
  {
    "content": "Impossibilities are merely things which we have not yet learned.",
    "author": "Charles W. Chesnutt"
  },
  {
    "content": "Work while you have the light. You are responsible for the talent that has been entrusted to you.",
    "author": "Henri-Frédéric Amiel"
  },
  {
    "content": "To fly, we have to have resistance.",
    "author": "Maya Lin"
  },
  {
    "content": "I will give you a definition of a proud man: he is a man who has neither vanity nor wisdom one filled with hatreds cannot be vain, neither can he be wise.",
    "author": "John Keats"
  },
  {
    "content": "Wisdom has never made a bigot, but learning has.",
    "author": "Josh Billings"
  },
  {
    "content": "There are no failures. Just experiences and your reactions to them.",
    "author": "Tom Krause"
  },
  {
    "content": "It is good even for old men to learn wisdom.",
    "author": "Aeschylus"
  },
  {
    "content": "For every failure, there's an alternative course of action. You just have to find it. When you come to a roadblock, take a detour.",
    "author": "Mary Kay Ash"
  },
  {
    "content": "Logic is the beginning of wisdom, not the end.",
    "author": "Leonard Nimoy"
  },
  {
    "content": "The greatest good you can do for another is not just share your riches, but reveal to them their own.",
    "author": "Benjamin Disraeli"
  },
  {
    "content": "I cannot give you the formula for success, but I can give you the formula for failure: which is: Try to please everybody.",
    "author": "Herbert Bayard Swope"
  },
  {
    "content": "If you seek truth you will not seek victory by dishonourable means, and if you find truth you will become invincible.",
    "author": "Epictetus"
  },
  {
    "content": "Imagination is the living power and prime agent of all human perception.",
    "author": "Samuel Taylor Coleridge"
  },
  {
    "content": "Those that know, do. Those that understand, teach.",
    "author": "Aristotle"
  },
  {
    "content": "Good timber does not grow with ease; the stronger the wind, the stronger the trees.",
    "author": "J. Willard Marriott"
  },
  {
    "content": "A man may fulfil the object of his existence by asking a question he cannot answer, and attempting a task he cannot achieve.",
    "author": "Oliver Wendell Holmes Jr."
  },
  {
    "content": "Gratitude makes sense of our past, brings peace for today, and creates a vision for tomorrow.",
    "author": "Melody Beattie"
  },
  {
    "content": "There is no duty we so underrate as the duty of being happy. By being happy we sow anonymous benefits upon the world.",
    "author": "Robert Louis Stevenson"
  },
  {
    "content": "Wisdom, compassion, and courage are the three universally recognized moral qualities of men.",
    "author": "Confucius"
  },
  {
    "content": "We shall never know all the good that a simple smile can do.",
    "author": "Mother Teresa"
  },
  {
    "content": "The best thing in every noble dream is the dreamer...",
    "author": "Moncure D. Conway"
  },
  {
    "content": "Life shrinks or expands in proportion to one's courage.",
    "author": "Anaïs Nin"
  },
  {
    "content": "The greatest remedy for anger is delay.",
    "author": "Seneca the Younger"
  },
  {
    "content": "A garden is always a series of losses set against a few triumphs, like life itself.",
    "author": "May Sarton"
  },
  {
    "content": "The wisest men follow their own direction.",
    "author": "Euripides"
  },
  {
    "content": "The difference between what we do and what we are capable of doing would suffice to solve most of the worlds problems.",
    "author": "Mahatma Gandhi"
  },
  {
    "content": "The superior man is modest in his speech, but exceeds in his actions.",
    "author": "Confucius"
  },
  {
    "content": "Change will not come if we wait for some other person or some other time. We are the ones we've been waiting for. We are the change that we seek.",
    "author": "Barack Obama"
  },
  {
    "content": "Wherever you go, go with all your heart.",
    "author": "Confucius"
  },
  {
    "content": "A life spent making mistakes is not only more honourable, but more useful than a life spent doing nothing.",
    "author": "George Bernard Shaw"
  },
  {
    "content": "If you set out to be liked, you would be prepared to compromise on anything at any time, and you would achieve nothing.",
    "author": "Margaret Thatcher"
  },
  {
    "content": "Be like the flower, turn your face to the sun.",
    "author": "Kahlil Gibran"
  },
  {
    "content": "Friendship multiplies the good of life and divides the evil.",
    "author": "Baltasar Gracián"
  },
  {
    "content": "Kindness is the golden chain by which society is bound together.",
    "author": "Johann Wolfgang von Goethe"
  },
  {
    "content": "Sometimes your joy is the source of your smile, but sometimes your smile can be the source of your joy.",
    "author": "Thích Nhất Hạnh"
  },
  {
    "content": "A friend is someone who gives you total freedom to be yourself.",
    "author": "Jim Morrison"
  },
  {
    "content": "Do the difficult things while they are easy and do the great things while they are small. A journey of a thousand miles must begin with a single step.",
    "author": "Laozi"
  },
  {
    "content": "I have done my best: that is about all the philosophy of living one needs.",
    "author": "Lin Yutang"
  },
  {
    "content": "Never mistake motion for action.",
    "author": "Ernest Hemingway"
  },
  {
    "content": "You, yourself, as much as anybody in the entire universe, deserve your love and affection.",
    "author": "Buddha"
  },
  {
    "content": "Ask yourself the secret of your success. Listen to your answer, and practice it.",
    "author": "Richard Bach"
  },
  {
    "content": "Give me a lever long enough and a fulcrum on which to place it, and I shall move the world.",
    "author": "Archimedes"
  },
  {
    "content": "Holy wisdom confounds Satan and all his wickednesses.",
    "author": "Francis of Assisi"
  },
  {
    "content": "Life is a succession of lessons, which must be lived to be understood.",
    "author": "Ralph Waldo Emerson"
  },
  {
    "content": "The only limit to your impact is your imagination and commitment.",
    "author": "Tony Robbins"
  },
  {
    "content": "Life is like a sewer. What you get out of it depends on what you put into it.",
    "author": "Tom Lehrer"
  },
  {
    "content": "A man must be big enough to admit his mistakes, smart enough to profit from them, and strong enough to correct them.",
    "author": "John C. Maxwell"
  },
  {
    "content": "If you have made mistakes, there is always another chance for you. You may have a fresh start any moment you choose.",
    "author": "Mary Pickford"
  },
  {
    "content": "I want you to be everything that's you, deep at the center of your being.",
    "author": "Confucius"
  },
  {
    "content": "Can you imagine what I would do if I could do all I can?",
    "author": "Sun Tzu"
  },
  {
    "content": "May our hearts garden of awakening bloom with hundreds of flowers.",
    "author": "Thích Nhất Hạnh"
  },
  {
    "content": "When you see a good person, think of becoming like him. When you see someone not so good, reflect on your own weak points.",
    "author": "Confucius"
  },
  {
    "content": "A man who doesn't trust himself can never really trust anyone else.",
    "author": "Jean François Paul de Gondi"
  },
  {
    "content": "When you dance, your purpose is not to get to a certain place on the floor. It's to enjoy each step along the way.",
    "author": "Wayne Dyer"
  },
  {
    "content": "Our lives are a sum total of the choices we have made.",
    "author": "Wayne Dyer"
  },
  {
    "content": "It is on our failures that we base a new and different and better success.",
    "author": "Havelock Ellis"
  },
  {
    "content": "When fate hands us a lemon, lets try to make lemonade.",
    "author": "Dale Carnegie"
  },
  {
    "content": "A man cannot be said to succeed in this life who does not satisfy one friend.",
    "author": "Henry David Thoreau"
  },
  {
    "content": "Every great dream begins with a dreamer. Always remember, you have within you the strength, the patience, and the passion to reach for the stars to change the world.",
    "author": "Harriet Tubman"
  },
  {
    "content": "They must often change, who would be constant in happiness or wisdom.",
    "author": "Confucius"
  },
  {
    "content": "Silence is a source of great strength.",
    "author": "Laozi"
  },
  {
    "content": "The purpose of learning is growth, and our minds, unlike our bodies, can continue growing as we continue to live.",
    "author": "Mortimer J. Adler"
  },
  {
    "content": "Don't cry because it's over. Smile because it happened.",
    "author": "Dr. Seuss"
  },
  {
    "content": "The meaning I picked, the one that changed my life: Overcome fear, behold wonder.",
    "author": "Richard Bach"
  },
  {
    "content": "The cause is hidden. The effect is visible to all.",
    "author": "Ovid"
  },
  {
    "content": "He who learns must suffer. And even in our sleep pain that cannot forget falls drop by drop upon the heart, and in our own despair, against our will, comes wisdom to us by the awful grace of God.",
    "author": "Aeschylus"
  },
  {
    "content": "I never worry about action, but only inaction.",
    "author": "Winston Churchill"
  },
  {
    "content": "At the center of your being you have the answer; you know who you are and you know what you want.",
    "author": "Laozi"
  },
  {
    "content": "If you're trying to achieve, there will be roadblocks. I've had them; everybody has had them. But obstacles don't have to stop you. If you run into a wall, don't turn around and give up. Figure out how to climb it, go through it, or work around it.",
    "author": "Michael Jordan"
  },
  {
    "content": "You will not be punished for your anger, you will be punished by your anger.",
    "author": "Buddha"
  },
  {
    "content": "Problems are only opportunities with thorns on them.",
    "author": "Hugh Miller"
  },
  {
    "content": "Forgiveness is that subtle thread that binds both love and friendship. Without forgiveness, you may not even have a child one day.",
    "author": "George Foreman"
  },
  {
    "content": "We cannot do everything at once, but we can do something at once.",
    "author": "Calvin Coolidge"
  },
  {
    "content": "Consider that not only do negative thoughts and emotions destroy our experience of peace, they also undermine our health.",
    "author": "Dalai Lama"
  },
  {
    "content": "The doorstep to the temple of wisdom is a knowledge of our own ignorance.",
    "author": "Benjamin Franklin"
  },
  {
    "content": "He is no fool who gives what he cannot keep to gain what he cannot lose.",
    "author": "Jim Elliot"
  },
  {
    "content": "Between saying and doing, many a pair of shoes is worn out.",
    "author": "Iris Murdoch"
  },
  {
    "content": "If the shoe doesn't fit, must we change the foot?",
    "author": "Gloria Steinem"
  },
  {
    "content": "When you come to the end of your rope, tie a knot and hang on.",
    "author": "Franklin D. Roosevelt"
  },
  {
    "content": "Nothing is at last sacred but the integrity of your own mind.",
    "author": "Ralph Waldo Emerson"
  },
  {
    "content": "One today is worth two tomorrows.",
    "author": "Benjamin Franklin"
  },
  {
    "content": "All of our technology is completely unnecessary to a happy life.",
    "author": "Tom Hodgkinson"
  },
  {
    "content": "It is fatal to enter any war without the will to win it.",
    "author": "Douglas MacArthur"
  },
  {
    "content": "Absence makes the heart grow fonder.",
    "author": "Thomas Haynes Bayly"
  },
  {
    "content": "When you judge another, you do not define them, you define yourself.",
    "author": "Wayne Dyer"
  },
  {
    "content": "Setting an example is not the main means of influencing another, it is the only means.",
    "author": "Albert Einstein"
  },
  {
    "content": "Always be mindful of the kindness and not the faults of others.",
    "author": "Buddha"
  },
  {
    "content": "Never reach out your hand unless you're willing to extend an arm.",
    "author": "Pope Paul VI"
  },
  {
    "content": "It's important to know that words don't move mountains. Work, exacting work moves mountains.",
    "author": "Danilo Dolci"
  },
  {
    "content": "You must do the things you think you cannot do.",
    "author": "Eleanor Roosevelt"
  },
  {
    "content": "I hear and I forget. I see and I remember. I do and I understand.",
    "author": "Confucius"
  },
  {
    "content": "All fixed set patterns are incapable of adaptability or pliability. The truth is outside of all fixed patterns.",
    "author": "Bruce Lee"
  },
  {
    "content": "True happiness arises, in the first place, from the enjoyment of one's self, and in the next, from the friendship and conversation of a few select companions.",
    "author": "Joseph Addison"
  },
  {
    "content": "To succeed, we must first believe that we can.",
    "author": "Michael Korda"
  },
  {
    "content": "As you think, so shall you become.",
    "author": "Bruce Lee"
  },
  {
    "content": "The only real failure in life is not to be true to the best one knows.",
    "author": "Buddha"
  },
  {
    "content": "Before you put on a frown, make absolutely sure there are no smiles available.",
    "author": "James M. Beggs"
  },
  {
    "content": "You have to do your own growing no matter how tall your grandfather was.",
    "author": "Abraham Lincoln"
  },
  {
    "content": "Life is movement-we breathe, we eat, we walk, we move!",
    "author": "John Pierrakos"
  },
  {
    "content": "Small opportunities are often the beginning of great enterprises.",
    "author": "Demosthenes"
  },
  {
    "content": "What you do not want done to yourself, do not do to others.",
    "author": "Confucius"
  },
  {
    "content": "The smallest deed is better than the greatest intention.",
    "author": "John Burroughs"
  },
  {
    "content": "Learning without reflection is a waste, reflection without learning is dangerous.",
    "author": "Confucius"
  },
  {
    "content": "Successful people ask better questions, and as a result, they get better answers.",
    "author": "Tony Robbins"
  },
  {
    "content": "Blessed is the man who expects nothing, for he shall never be disappointed.",
    "author": "Alexander Pope"
  },
  {
    "content": "Be not afraid of greatness: some are born great, some achieve greatness, and some have greatness thrust upon them.",
    "author": "William Shakespeare"
  },
  {
    "content": "Be faithful in small things because it is in them that your strength lies.",
    "author": "Mother Teresa"
  },
  {
    "content": "Difficulties are meant to rouse, not discourage. The human spirit is to grow strong by conflict.",
    "author": "William Ellery Channing"
  },
  {
    "content": "Anybody can make history. Only a great man can write it.",
    "author": "Oscar Wilde"
  },
  {
    "content": "Doing what you love is the cornerstone of having abundance in your life.",
    "author": "Wayne Dyer"
  },
  {
    "content": "No alibi will save you from accepting the responsibility.",
    "author": "Napoleon Hill"
  },
  {
    "content": "Everything you are against weakens you. Everything you are for empowers you.",
    "author": "Wayne Dyer"
  },
  {
    "content": "In a controversy the instant we feel anger we have already ceased striving for the truth, and have begun striving for ourselves.",
    "author": "Buddha"
  },
  {
    "content": "The world is round and the place which may seem like the end may also be the beginning.",
    "author": "Ivy Baker Priest"
  },
  {
    "content": "I'd rather regret the things I've done than regret the things I haven't done.",
    "author": "Lucille Ball"
  },
  {
    "content": "There is more wisdom in your body than in your deepest philosophy.",
    "author": "Friedrich Nietzsche"
  },
  {
    "content": "Time stays long enough for anyone who will use it.",
    "author": "Leonardo da Vinci"
  },
  {
    "content": "It is only the great hearted who can be true friends. The mean and cowardly, Can never know what true friendship means.",
    "author": "Charles Kingsley"
  },
  {
    "content": "Technology frightens me to death. It’s designed by engineers to impress other engineers. And they always come with instruction booklets that are written by engineers for other engineers — which is why almost no technology ever works.",
    "author": "John Cleese"
  },
  {
    "content": "I never see what has been done; I only see what remains to be done.",
    "author": "Marie Curie"
  },
  {
    "content": "Even if you're on the right track, you'll get run over if you just sit there.",
    "author": "Will Rogers"
  },
  {
    "content": "If we had no winter, the spring would not be so pleasant; if we did not sometimes taste of adversity, prosperity would not be so welcome.",
    "author": "Anne Bradstreet"
  },
  {
    "content": "All human wisdom is summed up in two words; wait and hope.",
    "author": "Alexandre Dumas"
  },
  {
    "content": "You cannot step twice into the same river, for other waters are continually flowing in.",
    "author": "Heraclitus"
  },
  {
    "content": "The secret of getting ahead is getting started.",
    "author": "Mark Twain"
  },
  {
    "content": "No distance of place or lapse of time can lessen the friendship of those who are thoroughly persuaded of each other's worth.",
    "author": "Robert Southey"
  },
  {
    "content": "What we see depends mainly on what we look for.",
    "author": "John Lubbock"
  },
  {
    "content": "Knowledge is going to make you stronger. Knowledge is going to let you control your life. Knowledge is going to give you the wisdom to teach their children. Knowledge is the thing that makes you smile in the face of disaster.",
    "author": "Avery Brooks"
  },
  {
    "content": "Neatness begets order; but from order to taste there is the same difference as from taste to genius, or from love to friendship.",
    "author": "Johann Kaspar Lavater"
  },
  {
    "content": "When I let go of what I am, I become what I might be.",
    "author": "Laozi"
  },
  {
    "content": "One's friends are that part of the human race with which one can be human.",
    "author": "George Santayana"
  },
  {
    "content": "Beware of missing chances; otherwise it may be altogether too late some day.",
    "author": "Franz Liszt"
  },
  {
    "content": "Wisdom is the power to put our time and our knowledge to the proper use.",
    "author": "Thomas J. Watson"
  },
  {
    "content": "The strong bond of friendship is not always a balanced equation; friendship is not always about giving and taking in equal shares. Instead, friendship is grounded in a feeling that you know exactly who will be there for you when you need something, no matter what or when.",
    "author": "Simon Sinek"
  },
  {
    "content": "I think somehow we learn who we really are and then live with that decision.",
    "author": "Eleanor Roosevelt"
  },
  {
    "content": "This is the final test of a gentleman: his respect for those who can be of no possible value to him.",
    "author": "William Lyon Phelps"
  },
  {
    "content": "Courage is not the absence of fear, but simply moving on with dignity despite that fear.",
    "author": "Pat Riley"
  },
  {
    "content": "There is nothing like returning to a place that remains unchanged to find the ways in which you yourself have altered.",
    "author": "Nelson Mandela"
  },
  {
    "content": "Let my skin and sinews and bones dry up, together with all the flesh and blood of my body! I welcome it! But I will not move from this spot until I have attained the supreme and final wisdom.",
    "author": "Buddha"
  },
  {
    "content": "There are basically two types of people. People who accomplish things, and people who claim to have accomplished things. The first group is less crowded.",
    "author": "Mark Twain"
  },
  {
    "content": "From error to error one discovers the entire truth.",
    "author": "Sigmund Freud"
  },
  {
    "content": "I am like a falling star who has finally found her place next to another in a lovely constellation, where we will sparkle in the heavens forever.",
    "author": "Amy Tan"
  },
  {
    "content": "Do not go where the path may lead, go instead where there is no path and leave a trail.",
    "author": "Ralph Waldo Emerson"
  },
  {
    "content": "No snowflake in an avalanche ever feels responsible.",
    "author": "Voltaire"
  },
  {
    "content": "What matters is the value we've created in our lives, the people we've made happy and how much we've grown as people.",
    "author": "Daisaku Ikeda"
  },
  {
    "content": "Wrinkles should merely indicate where smiles have been.",
    "author": "Mark Twain"
  },
  {
    "content": "Before you can inspire with emotion, you must be swamped with it yourself. Before you can move their tears, your own must flow. To convince them, you must yourself believe.",
    "author": "Winston Churchill"
  },
  {
    "content": "When we seek to discover the best in others, we somehow bring out the best in ourselves.",
    "author": "William Arthur Ward"
  },
  {
    "content": "Yesterdays home runs don't win today's games.",
    "author": "Babe Ruth"
  },
  {
    "content": "Wisdom and penetration are the fruit of experience, not the lessons of retirement and leisure. Great necessities call out great virtues.",
    "author": "Abigail Adams"
  },
  {
    "content": "One must be fond of people and trust them if one is not to make a mess of life.",
    "author": "E. M. Forster"
  },
  {
    "content": "The only journey is the one within.",
    "author": "Rainer Maria Rilke"
  },
  {
    "content": "The differences between friends cannot but reinforce their friendship.",
    "author": "Mao Zedong"
  },
  {
    "content": "It is one of the blessings of old friends that you can afford to be stupid with them.",
    "author": "Ralph Waldo Emerson"
  },
  {
    "content": "The moment one gives close attention to anything, it becomes a mysterious, awesome, indescribably magnificent world in itself.",
    "author": "Henry Miller"
  },
  {
    "content": "Forgiveness is choosing to love. It is the first skill of self-giving love.",
    "author": "Mahatma Gandhi"
  },
  {
    "content": "If a man does not make new acquaintances as he advances through life, he will soon find himself left alone. A man, sir, should keep his friendship in a constant repair.",
    "author": "Samuel Johnson"
  },
  {
    "content": "Life's most persistent and urgent question is, 'What are you doing for others?'",
    "author": "Martin Luther King Jr."
  },
  {
    "content": "Keep silence for the most part, and speak only when you must, and then briefly.",
    "author": "Epictetus"
  },
  {
    "content": "No one saves us but ourselves. No one can and no one may. We ourselves must walk the path.",
    "author": "Buddha"
  },
  {
    "content": "A hero is no braver than an ordinary man, but he is braver five minutes longer.",
    "author": "Ralph Waldo Emerson"
  },
  {
    "content": "The world has the habit of making room for the man whose actions show that he knows where he is going.",
    "author": "Napoleon Hill"
  },
  {
    "content": "Any sufficiently advanced technology is equivalent to magic.",
    "author": "Arthur C. Clarke"
  },
  {
    "content": "Reason and free inquiry are the only effectual agents against error.",
    "author": "Thomas Jefferson"
  },
  {
    "content": "It is very easy to forgive others their mistakes; it takes more grit to forgive them for having witnessed your own.",
    "author": "Jessamyn West"
  },
  {
    "content": "Knowledge rests not upon truth alone, but upon error also.",
    "author": "Carl Jung"
  },
  {
    "content": "Remember that sometimes not getting what you want is a wonderful stroke of luck.",
    "author": "Dalai Lama"
  },
  {
    "content": "Remember always that you not only have the right to be an individual, you have an obligation to be one.",
    "author": "Eleanor Roosevelt"
  },
  {
    "content": "It is a common experience that a problem difficult at night is resolved in the morning after the committee of sleep has worked on it.",
    "author": "John Steinbeck"
  },
  {
    "content": "To make no mistakes is not in the power of man; but from their errors and mistakes the wise and good learn wisdom for the future.",
    "author": "Plutarch"
  },
  {
    "content": "This world, after all our science and sciences, is still a miracle; wonderful, inscrutable, magical and more, to whosoever will think of it.",
    "author": "Thomas Carlyle"
  },
  {
    "content": "Friendship needs no words - it is solitude delivered from the anguish of loneliness.",
    "author": "Dag Hammarskjöld"
  },
  {
    "content": "Wherever a man may happen to turn, whatever a man may undertake, he will always end up by returning to the path which nature has marked out for him.",
    "author": "Johann Wolfgang von Goethe"
  },
  {
    "content": "If A is success in life, then A equals x plus y plus z. Work is x; y is play; and z is keeping your mouth shut.",
    "author": "Albert Einstein"
  },
  {
    "content": "If we could see the miracle of a single flower clearly, our whole life would change.",
    "author": "Buddha"
  },
  {
    "content": "When you are content to be simply yourself and don't compare or compete, everybody will respect you.",
    "author": "Laozi"
  },
  {
    "content": "The best preparation for tomorrow is doing your best today.",
    "author": "H. Jackson Brown Jr."
  },
  {
    "content": "Love demands infinitely less than friendship.",
    "author": "George Jean Nathan"
  },
  {
    "content": "If you spend too much time thinking about a thing, you'll never get it done.",
    "author": "Bruce Lee"
  },
  {
    "content": "The aim of life is self-development. To realize ones nature perfectly - that is what each of us is here for.",
    "author": "Oscar Wilde"
  },
  {
    "content": "And when the world is created, it is created in such a way that those eternal objects of God's loving wisdom become actualities - interacting with one another, relating to God in the finite realm.",
    "author": "Rowan Williams"
  },
  {
    "content": "Life has no blessing like a prudent friend.",
    "author": "Euripides"
  },
  {
    "content": "No pessimist ever discovered the secrets of the stars, or sailed to an uncharted land, or opened a new heaven to the human spirit.",
    "author": "Helen Keller"
  },
  {
    "content": "I'm not interested in age. People who tell me their age are silly. You're as old as you feel.",
    "author": "Elizabeth Arden"
  },
  {
    "content": "When people are like each other they tend to like each other.",
    "author": "Tony Robbins"
  },
  {
    "content": "Difficulties increase the nearer we get to the goal.",
    "author": "Johann Wolfgang von Goethe"
  },
  {
    "content": "In life, all good things come hard, but wisdom is the hardest to come by.",
    "author": "Lucille Ball"
  },
  {
    "content": "If you have knowledge, let others light their candles in it.",
    "author": "Margaret Fuller"
  },
  {
    "content": "Happiness can exist only in acceptance.",
    "author": "George Orwell"
  },
  {
    "content": "Life is really simple, but we insist on making it complicated.",
    "author": "Confucius"
  },
  {
    "content": "Friendship may, and often does, grow into love, but love never subsides into friendship.",
    "author": "Lord Byron"
  },
  {
    "content": "Weve got to have a dream if we are going to make a dream come true.",
    "author": "Walt Disney"
  },
  {
    "content": "Promises are the uniquely human way of ordering the future, making it predictable and reliable to the extent that this is humanly possible.",
    "author": "Hannah Arendt"
  },
  {
    "content": "Most of the important things in the world have been accomplished by people who have kept on trying when there seemed to be no hope at all.",
    "author": "Dale Carnegie"
  },
  {
    "content": "The way we communicate with others and with ourselves ultimately determines the quality of our lives.",
    "author": "Tony Robbins"
  },
  {
    "content": "Time you enjoyed wasting was not wasted.",
    "author": "John Lennon"
  },
  {
    "content": "Never bend your head. Always hold it high. Look the world right in the eye.",
    "author": "Helen Keller"
  },
  {
    "content": "All achievements, all earned riches, have their beginning in an idea.",
    "author": "Napoleon Hill"
  },
  {
    "content": "The poor man is not he who is without a cent, but he who is without a dream.",
    "author": "Harry Kemp"
  },
  {
    "content": "I have never been hurt by anything I didn't say.",
    "author": "Calvin Coolidge"
  },
  {
    "content": "Every artist dips his brush in his own soul, and paints his own nature into his pictures.",
    "author": "Henry Ward Beecher"
  },
  {
    "content": "The right way is not always the popular and easy way. Standing for right when it is unpopular is a true test of moral character.",
    "author": "Margaret Chase Smith"
  },
  {
    "content": "Don't wait. The time will never be just right.",
    "author": "Napoleon Hill"
  }
]
